/* automatically generated by rust-bindgen 0.55.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const DQ_EEMAXSIZE: u32 = 2048;
pub const DQ_MAXCHAN: u32 = 64;
pub const DQ_CHANMASK: u32 = 63;
pub const DQ_ONEVOLTINNV: u32 = 1000000000;
pub const DQ_MAXDEVN: u32 = 32;
pub const DQ_MASKDEVN: u32 = 31;
pub const DQ_MAXDEVPHYS: u32 = 16;
pub const DQ_MAXSS: u32 = 8;
pub const DQ_MASKSS: u32 = 7;
pub const DQ_SS0IN: u32 = 0;
pub const DQ_SS0OUT: u32 = 1;
pub const DQ_SS1IN: u32 = 2;
pub const DQ_SS1OUT: u32 = 3;
pub const DQ_SS2IN: u32 = 4;
pub const DQ_SS2OUT: u32 = 5;
pub const DQ_SS3IN: u32 = 6;

pub const DQ_AVMAP_INPKT_MISSED: u32 = 2;
pub const DQ_AVMAP_INPKT_RESENT: u32 = 3;
pub const DQ_AVMAP_OUTPKT_ACK: u32 = 4;
pub const DQ_AVMAP_OUTPKT_MISSED: u32 = 5;
pub const DQ_AVMAP_TIMEOUT: u32 = 6;
pub const DQ_AVMAP_IN_ERROR: u32 = 7;
pub const DQ_SS_TYPES: u32 = 2;
pub const DQRT_USE_BLOCK_CONVERSION: u32 = 1;
pub const DQRT_DEFAULT_DEBUG_OPTION: u32 = 1;
pub const DQ_RTRE_WAIT_PACKET: u32 = 2;
pub const DQ_RTRE_PROC_PACKET: u32 = 4;
pub const DQ_RTA_QUEUE_DEPTH: u32 = 64;
pub const DQ_RTA_MAX_QUEUE_DEPTH: u32 = 1024;
pub const DQ_RTA_NUM_PACKETS_WAIT: u32 = 3;
pub const DQ_AVMAP_TRIG_SOFT: u32 = 0;
pub const DQ_AVMAP_TRIG_RISING: u32 = 1;
pub const DQ_AVMAP_TRIG_FALLING: u32 = 2;
pub const DQ_AVMAP_TRIG_NOCFG: i32 = -1;
pub const DQ_AVMAP_TYP_WMRK: u32 = 0;
pub const DQ_AVMAP_TYP_TIME: u32 = 1;
pub const DQ_AVMAP_TYP_CLCK: u32 = 2;
pub type size_t = ::std::os::raw::c_ulong;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type u_short = __u_short;
pub type u_long = __u_long;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type sa_family_t = ::std::os::raw::c_ushort;
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
pub type in_port_t = u16;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_zero as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_zero)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
pub type SOCKET = ::std::os::raw::c_int;
pub type uint8 = ::std::os::raw::c_uchar;
pub type uint16 = ::std::os::raw::c_ushort;
pub type uint32 = ::std::os::raw::c_uint;
pub type uint64 = ::std::os::raw::c_ulonglong;
pub type int8 = ::std::os::raw::c_char;
pub type int16 = ::std::os::raw::c_short;
pub type int32 = ::std::os::raw::c_int;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct _SIGS {
    pub clocksrc: [uint8; 4usize],
    pub clockedge: [uint8; 4usize],
    pub trigsrc: [uint8; 4usize],
    pub trigedge: [uint8; 4usize],
    pub diosrc: [uint8; 4usize],
    pub diodir: [uint8; 4usize],
    pub isosrc: [uint8; 4usize],
    pub syncxsrc: [uint8; 4usize],
    pub cmd: uint32,
}
#[test]
fn bindgen_test_layout__SIGS() {
    assert_eq!(
        ::std::mem::size_of::<_SIGS>(),
        36usize,
        concat!("Size of: ", stringify!(_SIGS))
    );
    assert_eq!(
        ::std::mem::align_of::<_SIGS>(),
        1usize,
        concat!("Alignment of ", stringify!(_SIGS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).clocksrc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(clocksrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).clockedge as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(clockedge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).trigsrc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(trigsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).trigedge as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(trigedge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).diosrc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(diosrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).diodir as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(diodir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).isosrc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(isosrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).syncxsrc as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(syncxsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SIGS>())).cmd as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SIGS),
            "::",
            stringify!(cmd)
        )
    );
}
pub type SGNLS = _SIGS;
pub type pSGNLS = *mut _SIGS;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct _SYNCPAL {
    pub pll_frq: f32,
    pub pll_Pt: uint16,
    pub pll_Qt: uint16,
    pub pll_Div: uint32,
    pub log_Div: uint32,
}
#[test]
fn bindgen_test_layout__SYNCPAL() {
    assert_eq!(
        ::std::mem::size_of::<_SYNCPAL>(),
        16usize,
        concat!("Size of: ", stringify!(_SYNCPAL))
    );
    assert_eq!(
        ::std::mem::align_of::<_SYNCPAL>(),
        1usize,
        concat!("Alignment of ", stringify!(_SYNCPAL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYNCPAL>())).pll_frq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYNCPAL),
            "::",
            stringify!(pll_frq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYNCPAL>())).pll_Pt as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYNCPAL),
            "::",
            stringify!(pll_Pt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYNCPAL>())).pll_Qt as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYNCPAL),
            "::",
            stringify!(pll_Qt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYNCPAL>())).pll_Div as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYNCPAL),
            "::",
            stringify!(pll_Div)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYNCPAL>())).log_Div as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYNCPAL),
            "::",
            stringify!(log_Div)
        )
    );
}
pub type SYNCPLL = _SYNCPAL;
pub type pSYNCPLL = *mut _SYNCPAL;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYNCRT {
    pub sync_x: [[uint8; 4usize]; 4usize],
}
#[test]
fn bindgen_test_layout__SYNCRT() {
    assert_eq!(
        ::std::mem::size_of::<_SYNCRT>(),
        16usize,
        concat!("Size of: ", stringify!(_SYNCRT))
    );
    assert_eq!(
        ::std::mem::align_of::<_SYNCRT>(),
        1usize,
        concat!("Alignment of ", stringify!(_SYNCRT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SYNCRT>())).sync_x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SYNCRT),
            "::",
            stringify!(sync_x)
        )
    );
}
pub type SYNCRT = _SYNCRT;
pub type pSYNCRT = *mut _SYNCRT;
#[repr(C, packed)]
pub struct DQPKT {
    pub dqProlog: uint32,
    pub dqTStamp: uint16,
    pub dqCounter: uint16,
    pub dqCommand: uint32,
    pub rqId: uint32,
    pub dqData: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQPKT() {
    assert_eq!(
        ::std::mem::size_of::<DQPKT>(),
        16usize,
        concat!("Size of: ", stringify!(DQPKT))
    );
    assert_eq!(
        ::std::mem::align_of::<DQPKT>(),
        1usize,
        concat!("Alignment of ", stringify!(DQPKT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPKT>())).dqProlog as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPKT),
            "::",
            stringify!(dqProlog)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPKT>())).dqTStamp as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPKT),
            "::",
            stringify!(dqTStamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPKT>())).dqCounter as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPKT),
            "::",
            stringify!(dqCounter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPKT>())).dqCommand as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPKT),
            "::",
            stringify!(dqCommand)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPKT>())).rqId as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPKT),
            "::",
            stringify!(rqId)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPKT>())).dqData as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPKT),
            "::",
            stringify!(dqData)
        )
    );
}
pub type pDQPKT = *mut DQPKT;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQRDCFG {
    pub model: uint32,
    pub ipaddr: uint32,
    pub sernum: uint32,
    pub caldate: uint32,
    pub mfgdate: uint32,
    pub devmod: [uint16; 32usize],
    pub option: [uint16; 32usize],
    pub tx_n: [uint32; 32usize],
    pub rx_n: [uint32; 32usize],
}
#[test]
fn bindgen_test_layout_DQRDCFG() {
    assert_eq!(
        ::std::mem::size_of::<DQRDCFG>(),
        404usize,
        concat!("Size of: ", stringify!(DQRDCFG))
    );
    assert_eq!(
        ::std::mem::align_of::<DQRDCFG>(),
        1usize,
        concat!("Alignment of ", stringify!(DQRDCFG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).model as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).ipaddr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(ipaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).sernum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(sernum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).caldate as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(caldate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).mfgdate as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(mfgdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).devmod as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(devmod)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).option as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(option)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).tx_n as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(tx_n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCFG>())).rx_n as *const _ as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCFG),
            "::",
            stringify!(rx_n)
        )
    );
}
pub type pDQRDCFG = *mut DQRDCFG;
#[repr(C, packed)]
pub struct DQWRVALM {
    pub addr: uint32,
    pub increment: int16,
    pub size: uint8,
    pub count: uint8,
    pub data: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQWRVALM() {
    assert_eq!(
        ::std::mem::size_of::<DQWRVALM>(),
        8usize,
        concat!("Size of: ", stringify!(DQWRVALM))
    );
    assert_eq!(
        ::std::mem::align_of::<DQWRVALM>(),
        1usize,
        concat!("Alignment of ", stringify!(DQWRVALM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRVALM>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRVALM),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRVALM>())).increment as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRVALM),
            "::",
            stringify!(increment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRVALM>())).size as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRVALM),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRVALM>())).count as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRVALM),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRVALM>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRVALM),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQWRVALM = *mut DQWRVALM;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct wDQRDVALM {
    pub addr: uint32,
    pub increment: int16,
    pub size: uint8,
    pub count: uint8,
}
#[test]
fn bindgen_test_layout_wDQRDVALM() {
    assert_eq!(
        ::std::mem::size_of::<wDQRDVALM>(),
        8usize,
        concat!("Size of: ", stringify!(wDQRDVALM))
    );
    assert_eq!(
        ::std::mem::align_of::<wDQRDVALM>(),
        1usize,
        concat!("Alignment of ", stringify!(wDQRDVALM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wDQRDVALM>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wDQRDVALM),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wDQRDVALM>())).increment as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(wDQRDVALM),
            "::",
            stringify!(increment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wDQRDVALM>())).size as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(wDQRDVALM),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wDQRDVALM>())).count as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(wDQRDVALM),
            "::",
            stringify!(count)
        )
    );
}
pub type pwDQRDVALM = *mut wDQRDVALM;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSETCFG {
    pub dev: uint8,
    pub ss: uint8,
    pub cfg: uint32,
}
#[test]
fn bindgen_test_layout_DQSETCFG() {
    assert_eq!(
        ::std::mem::size_of::<DQSETCFG>(),
        6usize,
        concat!("Size of: ", stringify!(DQSETCFG))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETCFG>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETCFG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCFG>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCFG),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCFG>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCFG),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCFG>())).cfg as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCFG),
            "::",
            stringify!(cfg)
        )
    );
}
#[repr(C, packed)]
pub struct DQEVENT {
    pub dev: uint8,
    pub ss: uint8,
    pub size: uint16,
    pub event: uint32,
    pub data: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQEVENT() {
    assert_eq!(
        ::std::mem::size_of::<DQEVENT>(),
        8usize,
        concat!("Size of: ", stringify!(DQEVENT))
    );
    assert_eq!(
        ::std::mem::align_of::<DQEVENT>(),
        1usize,
        concat!("Alignment of ", stringify!(DQEVENT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEVENT>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEVENT),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEVENT>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEVENT),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEVENT>())).size as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEVENT),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEVENT>())).event as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEVENT),
            "::",
            stringify!(event)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEVENT>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEVENT),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQEVENT = *mut DQEVENT;
#[repr(C, packed)]
pub struct DQAXMAP {
    pub dev: uint8,
    pub ss: uint8,
    pub size: uint16,
    pub mode: uint32,
    pub data: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQAXMAP() {
    assert_eq!(
        ::std::mem::size_of::<DQAXMAP>(),
        8usize,
        concat!("Size of: ", stringify!(DQAXMAP))
    );
    assert_eq!(
        ::std::mem::align_of::<DQAXMAP>(),
        1usize,
        concat!("Alignment of ", stringify!(DQAXMAP))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAXMAP>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAXMAP),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAXMAP>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAXMAP),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAXMAP>())).size as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAXMAP),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAXMAP>())).mode as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAXMAP),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAXMAP>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAXMAP),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C, packed)]
pub struct DQGETCFG {
    pub dev: uint8,
    pub ss: uint8,
    pub chan: uint32,
    pub cfg: uint32,
    pub cldiv: uint32,
    pub cvdiv: uint32,
    pub clsize: uint32,
    pub cl: __IncompleteArrayField<uint32>,
}
#[test]
fn bindgen_test_layout_DQGETCFG() {
    assert_eq!(
        ::std::mem::size_of::<DQGETCFG>(),
        22usize,
        concat!("Size of: ", stringify!(DQGETCFG))
    );
    assert_eq!(
        ::std::mem::align_of::<DQGETCFG>(),
        1usize,
        concat!("Alignment of ", stringify!(DQGETCFG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).chan as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(chan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).cfg as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).cldiv as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(cldiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).cvdiv as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(cvdiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).clsize as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(clsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG>())).cl as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG),
            "::",
            stringify!(cl)
        )
    );
}
pub type pDQGETCFG = *mut DQGETCFG;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQGETCFG_RQ {
    pub dev: uint8,
    pub ss: uint8,
    pub chan: uint32,
}
#[test]
fn bindgen_test_layout_DQGETCFG_RQ() {
    assert_eq!(
        ::std::mem::size_of::<DQGETCFG_RQ>(),
        6usize,
        concat!("Size of: ", stringify!(DQGETCFG_RQ))
    );
    assert_eq!(
        ::std::mem::align_of::<DQGETCFG_RQ>(),
        1usize,
        concat!("Alignment of ", stringify!(DQGETCFG_RQ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG_RQ>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG_RQ),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG_RQ>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG_RQ),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQGETCFG_RQ>())).chan as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQGETCFG_RQ),
            "::",
            stringify!(chan)
        )
    );
}
pub type pDQGETCFG_RQ = *mut DQGETCFG_RQ;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQWRCHNL {
    pub dev: uint8,
    pub ss: uint8,
    pub chnl: uint8,
    pub data: uint32,
}
#[test]
fn bindgen_test_layout_DQWRCHNL() {
    assert_eq!(
        ::std::mem::size_of::<DQWRCHNL>(),
        7usize,
        concat!("Size of: ", stringify!(DQWRCHNL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQWRCHNL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQWRCHNL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRCHNL>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRCHNL),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRCHNL>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRCHNL),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRCHNL>())).chnl as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRCHNL),
            "::",
            stringify!(chnl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRCHNL>())).data as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRCHNL),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQWRCHNL = *mut DQWRCHNL;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCHNL {
    pub dev: uint8,
    pub ss: uint8,
    pub chnl: uint8,
}
#[test]
fn bindgen_test_layout_DQCHNL() {
    assert_eq!(
        ::std::mem::size_of::<DQCHNL>(),
        3usize,
        concat!("Size of: ", stringify!(DQCHNL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCHNL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCHNL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCHNL>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCHNL),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCHNL>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCHNL),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCHNL>())).chnl as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCHNL),
            "::",
            stringify!(chnl)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQWRCHNL32 {
    pub devch: DQCHNL,
    pub data: uint32,
}
#[test]
fn bindgen_test_layout_DQWRCHNL32() {
    assert_eq!(
        ::std::mem::size_of::<DQWRCHNL32>(),
        7usize,
        concat!("Size of: ", stringify!(DQWRCHNL32))
    );
    assert_eq!(
        ::std::mem::align_of::<DQWRCHNL32>(),
        1usize,
        concat!("Alignment of ", stringify!(DQWRCHNL32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRCHNL32>())).devch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRCHNL32),
            "::",
            stringify!(devch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRCHNL32>())).data as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRCHNL32),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQRDCHNL {
    pub dev: uint8,
    pub ss: uint8,
    pub chnl: uint8,
}
#[test]
fn bindgen_test_layout_DQRDCHNL() {
    assert_eq!(
        ::std::mem::size_of::<DQRDCHNL>(),
        3usize,
        concat!("Size of: ", stringify!(DQRDCHNL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQRDCHNL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQRDCHNL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCHNL>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCHNL),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCHNL>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCHNL),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRDCHNL>())).chnl as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRDCHNL),
            "::",
            stringify!(chnl)
        )
    );
}
pub type pDQRDCHNL = *mut DQRDCHNL;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSETCLK {
    pub dev: uint8,
    pub ss: uint8,
    pub clocksel: uint8,
    pub frq: f32,
}
#[test]
fn bindgen_test_layout_DQSETCLK() {
    assert_eq!(
        ::std::mem::size_of::<DQSETCLK>(),
        7usize,
        concat!("Size of: ", stringify!(DQSETCLK))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETCLK>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETCLK))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCLK>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCLK),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCLK>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCLK),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCLK>())).clocksel as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCLK),
            "::",
            stringify!(clocksel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCLK>())).frq as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCLK),
            "::",
            stringify!(frq)
        )
    );
}
pub type pDQSETCLK = *mut DQSETCLK;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSETCL {
    pub dev: uint8,
    pub ss: uint8,
    pub entry: uint32,
}
#[test]
fn bindgen_test_layout_DQSETCL() {
    assert_eq!(
        ::std::mem::size_of::<DQSETCL>(),
        6usize,
        concat!("Size of: ", stringify!(DQSETCL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETCL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETCL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCL>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCL),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCL>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCL),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCL>())).entry as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCL),
            "::",
            stringify!(entry)
        )
    );
}
pub type pDQSETCL = *mut DQSETCL;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSETTRL {
    pub dmapid: uint16,
    pub dev: uint8,
    pub ss: uint8,
    pub ch: uint32,
    pub flags: uint32,
    pub samples: uint16,
}
#[test]
fn bindgen_test_layout_DQSETTRL() {
    assert_eq!(
        ::std::mem::size_of::<DQSETTRL>(),
        14usize,
        concat!("Size of: ", stringify!(DQSETTRL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETTRL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETTRL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRL>())).dmapid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRL),
            "::",
            stringify!(dmapid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRL>())).dev as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRL),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRL>())).ss as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRL),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRL>())).ch as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRL),
            "::",
            stringify!(ch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRL>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRL),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRL>())).samples as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRL),
            "::",
            stringify!(samples)
        )
    );
}
pub type pDQSETTRL = *mut DQSETTRL;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSETTRIG {
    pub dev: uint8,
    pub ss: uint8,
    pub ch: uint8,
    pub mode: uint8,
    pub trigtypeS: uint32,
    pub uS: DQSETTRIG__bindgen_ty_1,
    pub trigtypeP: uint32,
    pub uP: DQSETTRIG__bindgen_ty_2,
    pub hyster: f32,
    pub prescans: ::std::os::raw::c_int,
    pub postscans: ::std::os::raw::c_int,
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union DQSETTRIG__bindgen_ty_1 {
    pub levelS: f32,
    pub maskS: uint32,
    _bindgen_union_align: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_DQSETTRIG__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<DQSETTRIG__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(DQSETTRIG__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETTRIG__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETTRIG__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG__bindgen_ty_1>())).levelS as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG__bindgen_ty_1),
            "::",
            stringify!(levelS)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG__bindgen_ty_1>())).maskS as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG__bindgen_ty_1),
            "::",
            stringify!(maskS)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union DQSETTRIG__bindgen_ty_2 {
    pub levelP: f32,
    pub maskP: uint32,
    _bindgen_union_align: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_DQSETTRIG__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<DQSETTRIG__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(DQSETTRIG__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETTRIG__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETTRIG__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG__bindgen_ty_2>())).levelP as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG__bindgen_ty_2),
            "::",
            stringify!(levelP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG__bindgen_ty_2>())).maskP as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG__bindgen_ty_2),
            "::",
            stringify!(maskP)
        )
    );
}
#[test]
fn bindgen_test_layout_DQSETTRIG() {
    assert_eq!(
        ::std::mem::size_of::<DQSETTRIG>(),
        32usize,
        concat!("Size of: ", stringify!(DQSETTRIG))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETTRIG>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETTRIG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).ch as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(ch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).mode as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).trigtypeS as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(trigtypeS)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).uS as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(uS)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).trigtypeP as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(trigtypeP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).uP as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(uP)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).hyster as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(hyster)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).prescans as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(prescans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETTRIG>())).postscans as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETTRIG),
            "::",
            stringify!(postscans)
        )
    );
}
pub type pDQSETTRIG = *mut DQSETTRIG;
#[repr(C, packed)]
pub struct DQWRRD {
    pub dmapid: uint32,
    pub size: uint32,
    pub data: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQWRRD() {
    assert_eq!(
        ::std::mem::size_of::<DQWRRD>(),
        8usize,
        concat!("Size of: ", stringify!(DQWRRD))
    );
    assert_eq!(
        ::std::mem::align_of::<DQWRRD>(),
        1usize,
        concat!("Alignment of ", stringify!(DQWRRD))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD>())).dmapid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD),
            "::",
            stringify!(dmapid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQWRRD = *mut DQWRRD;
#[repr(C, packed)]
pub struct DQWRRD32 {
    pub dev: uint16,
    pub read_1st: uint16,
    pub addr_w: uint16,
    pub size_w: uint16,
    pub addr_r: uint16,
    pub size_r: uint16,
    pub data: __IncompleteArrayField<uint32>,
}
#[test]
fn bindgen_test_layout_DQWRRD32() {
    assert_eq!(
        ::std::mem::size_of::<DQWRRD32>(),
        12usize,
        concat!("Size of: ", stringify!(DQWRRD32))
    );
    assert_eq!(
        ::std::mem::align_of::<DQWRRD32>(),
        1usize,
        concat!("Alignment of ", stringify!(DQWRRD32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD32>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD32),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD32>())).read_1st as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD32),
            "::",
            stringify!(read_1st)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD32>())).addr_w as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD32),
            "::",
            stringify!(addr_w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD32>())).size_w as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD32),
            "::",
            stringify!(size_w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD32>())).addr_r as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD32),
            "::",
            stringify!(addr_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD32>())).size_r as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD32),
            "::",
            stringify!(size_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRD32>())).data as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRD32),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQWRRD32 = *mut DQWRRD32;
#[repr(C, packed)]
pub struct DQFIFO {
    pub dev: uint8,
    pub ss: uint8,
    pub size: uint16,
    pub data: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQFIFO() {
    assert_eq!(
        ::std::mem::size_of::<DQFIFO>(),
        4usize,
        concat!("Size of: ", stringify!(DQFIFO))
    );
    assert_eq!(
        ::std::mem::align_of::<DQFIFO>(),
        1usize,
        concat!("Alignment of ", stringify!(DQFIFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO>())).size as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQFIFO = *mut DQFIFO;
#[repr(C, packed)]
pub struct DQFIFO32 {
    pub dev: uint8,
    pub ss: uint8,
    pub size: uint16,
    pub data: __IncompleteArrayField<uint32>,
}
#[test]
fn bindgen_test_layout_DQFIFO32() {
    assert_eq!(
        ::std::mem::size_of::<DQFIFO32>(),
        4usize,
        concat!("Size of: ", stringify!(DQFIFO32))
    );
    assert_eq!(
        ::std::mem::align_of::<DQFIFO32>(),
        1usize,
        concat!("Alignment of ", stringify!(DQFIFO32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO32>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO32),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO32>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO32),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO32>())).size as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO32),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFIFO32>())).data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFIFO32),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQFIFO32 = *mut DQFIFO32;
#[repr(C, packed)]
pub struct DQWRRDFIFO {
    pub dev: uint8,
    pub sswr: uint8,
    pub ssrd: uint8,
    pub chwr: uint8,
    pub chrd: uint8,
    pub sizewr: uint16,
    pub sizerd: uint16,
    pub avlwr: uint16,
    pub avlrd: uint16,
    pub data: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQWRRDFIFO() {
    assert_eq!(
        ::std::mem::size_of::<DQWRRDFIFO>(),
        13usize,
        concat!("Size of: ", stringify!(DQWRRDFIFO))
    );
    assert_eq!(
        ::std::mem::align_of::<DQWRRDFIFO>(),
        1usize,
        concat!("Alignment of ", stringify!(DQWRRDFIFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).sswr as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(sswr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).ssrd as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(ssrd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).chwr as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(chwr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).chrd as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(chrd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).sizewr as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(sizewr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).sizerd as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(sizerd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).avlwr as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(avlwr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).avlrd as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(avlrd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQWRRDFIFO>())).data as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(DQWRRDFIFO),
            "::",
            stringify!(data)
        )
    );
}
pub type pDQWRRDFIFO = *mut DQWRRDFIFO;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQFLASHDATA {
    pub Sector: uint16,
    pub Address: uint32,
    pub Size: uint32,
}
#[test]
fn bindgen_test_layout_DQFLASHDATA() {
    assert_eq!(
        ::std::mem::size_of::<DQFLASHDATA>(),
        10usize,
        concat!("Size of: ", stringify!(DQFLASHDATA))
    );
    assert_eq!(
        ::std::mem::align_of::<DQFLASHDATA>(),
        1usize,
        concat!("Alignment of ", stringify!(DQFLASHDATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFLASHDATA>())).Sector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFLASHDATA),
            "::",
            stringify!(Sector)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFLASHDATA>())).Address as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFLASHDATA),
            "::",
            stringify!(Address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFLASHDATA>())).Size as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFLASHDATA),
            "::",
            stringify!(Size)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQFPGADATA {
    pub BaseAddr: uint32,
    pub Page: uint16,
    pub Size: uint32,
    pub CrcVerification: uint8,
}
#[test]
fn bindgen_test_layout_DQFPGADATA() {
    assert_eq!(
        ::std::mem::size_of::<DQFPGADATA>(),
        11usize,
        concat!("Size of: ", stringify!(DQFPGADATA))
    );
    assert_eq!(
        ::std::mem::align_of::<DQFPGADATA>(),
        1usize,
        concat!("Alignment of ", stringify!(DQFPGADATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFPGADATA>())).BaseAddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFPGADATA),
            "::",
            stringify!(BaseAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFPGADATA>())).Page as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFPGADATA),
            "::",
            stringify!(Page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFPGADATA>())).Size as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFPGADATA),
            "::",
            stringify!(Size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQFPGADATA>())).CrcVerification as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQFPGADATA),
            "::",
            stringify!(CrcVerification)
        )
    );
}
#[repr(C, packed)]
pub struct DQJTAGDATA {
    pub baseAddr: uint32,
    pub size: uint32,
    pub err: uint32,
    pub config: uint8,
    pub tms_tdi_tck: uint8,
    pub buffer: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQJTAGDATA() {
    assert_eq!(
        ::std::mem::size_of::<DQJTAGDATA>(),
        14usize,
        concat!("Size of: ", stringify!(DQJTAGDATA))
    );
    assert_eq!(
        ::std::mem::align_of::<DQJTAGDATA>(),
        1usize,
        concat!("Alignment of ", stringify!(DQJTAGDATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQJTAGDATA>())).baseAddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQJTAGDATA),
            "::",
            stringify!(baseAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQJTAGDATA>())).size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQJTAGDATA),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQJTAGDATA>())).err as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQJTAGDATA),
            "::",
            stringify!(err)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQJTAGDATA>())).config as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQJTAGDATA),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQJTAGDATA>())).tms_tdi_tck as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(DQJTAGDATA),
            "::",
            stringify!(tms_tdi_tck)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQJTAGDATA>())).buffer as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(DQJTAGDATA),
            "::",
            stringify!(buffer)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCRCINFO {
    pub fwcrc: uint32,
    pub fwver: uint32,
    pub paramcrc: uint32,
    pub initcrc: uint32,
    pub opercrc: uint32,
    pub sdcrc: uint32,
    pub build: uint32,
}
#[test]
fn bindgen_test_layout_DQCRCINFO() {
    assert_eq!(
        ::std::mem::size_of::<DQCRCINFO>(),
        28usize,
        concat!("Size of: ", stringify!(DQCRCINFO))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCRCINFO>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCRCINFO))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCRCINFO>())).fwcrc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCRCINFO),
            "::",
            stringify!(fwcrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCRCINFO>())).fwver as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCRCINFO),
            "::",
            stringify!(fwver)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCRCINFO>())).paramcrc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCRCINFO),
            "::",
            stringify!(paramcrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCRCINFO>())).initcrc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCRCINFO),
            "::",
            stringify!(initcrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCRCINFO>())).opercrc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCRCINFO),
            "::",
            stringify!(opercrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCRCINFO>())).sdcrc as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCRCINFO),
            "::",
            stringify!(sdcrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCRCINFO>())).build as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCRCINFO),
            "::",
            stringify!(build)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSETCOMM {
    pub todo: uint8,
    pub MAC: [uint8; 6usize],
    pub netip: uint32,
    pub gateway: uint32,
    pub netmask: uint32,
    pub startup: uint32,
    pub baudrate: uint32,
    pub udpport: uint16,
    pub signature: [uint8; 28usize],
}
#[test]
fn bindgen_test_layout_DQSETCOMM() {
    assert_eq!(
        ::std::mem::size_of::<DQSETCOMM>(),
        57usize,
        concat!("Size of: ", stringify!(DQSETCOMM))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETCOMM>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETCOMM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).todo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(todo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).MAC as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(MAC)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).netip as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(netip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).gateway as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(gateway)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).netmask as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(netmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).startup as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(startup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).baudrate as *const _ as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(baudrate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).udpport as *const _ as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(udpport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCOMM>())).signature as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCOMM),
            "::",
            stringify!(signature)
        )
    );
}
pub type pDQSETCOMM = *mut DQSETCOMM;
#[repr(C)]
pub struct DQSETPRM {
    pub dev: uint8,
    pub ss: uint8,
    pub mode: uint8,
    pub value: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQSETPRM() {
    assert_eq!(
        ::std::mem::size_of::<DQSETPRM>(),
        3usize,
        concat!("Size of: ", stringify!(DQSETPRM))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETPRM>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETPRM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETPRM>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETPRM),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETPRM>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETPRM),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETPRM>())).mode as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETPRM),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETPRM>())).value as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETPRM),
            "::",
            stringify!(value)
        )
    );
}
pub type pDQSETPRM = *mut DQSETPRM;
pub type DQGETPRM = DQSETPRM;
pub type pDQGETPRM = *mut DQSETPRM;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSETCAL {
    pub dev: uint8,
    pub ss: uint8,
    pub channel: uint8,
    pub dac: uint8,
    pub value: uint32,
}
#[test]
fn bindgen_test_layout_DQSETCAL() {
    assert_eq!(
        ::std::mem::size_of::<DQSETCAL>(),
        8usize,
        concat!("Size of: ", stringify!(DQSETCAL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSETCAL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSETCAL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCAL>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCAL),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCAL>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCAL),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCAL>())).channel as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCAL),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCAL>())).dac as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCAL),
            "::",
            stringify!(dac)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSETCAL>())).value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSETCAL),
            "::",
            stringify!(value)
        )
    );
}
pub type pDQSETCAL = *mut DQSETCAL;
#[repr(C, packed)]
pub struct DQIOCTL {
    pub dev: uint8,
    pub ss: uint8,
    pub cmd: uint32,
    pub arg: __IncompleteArrayField<uint8>,
}
#[test]
fn bindgen_test_layout_DQIOCTL() {
    assert_eq!(
        ::std::mem::size_of::<DQIOCTL>(),
        6usize,
        concat!("Size of: ", stringify!(DQIOCTL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQIOCTL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQIOCTL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQIOCTL>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQIOCTL),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQIOCTL>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQIOCTL),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQIOCTL>())).cmd as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQIOCTL),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQIOCTL>())).arg as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQIOCTL),
            "::",
            stringify!(arg)
        )
    );
}
pub type pDQIOCTL = *mut DQIOCTL;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQBURST {
    pub dev: uint8,
    pub ss: uint8,
    pub pre: uint32,
    pub post: uint32,
    pub trigger: uint32,
}
#[test]
fn bindgen_test_layout_DQBURST() {
    assert_eq!(
        ::std::mem::size_of::<DQBURST>(),
        14usize,
        concat!("Size of: ", stringify!(DQBURST))
    );
    assert_eq!(
        ::std::mem::align_of::<DQBURST>(),
        1usize,
        concat!("Alignment of ", stringify!(DQBURST))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQBURST>())).dev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQBURST),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQBURST>())).ss as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(DQBURST),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQBURST>())).pre as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQBURST),
            "::",
            stringify!(pre)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQBURST>())).post as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQBURST),
            "::",
            stringify!(post)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQBURST>())).trigger as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQBURST),
            "::",
            stringify!(trigger)
        )
    );
}
pub type pDQBURST = *mut DQBURST;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCLRMEM {
    pub devmask: uint32,
    pub cmd: uint32,
    pub mode: uint32,
    pub status: int32,
}
#[test]
fn bindgen_test_layout_DQCLRMEM() {
    assert_eq!(
        ::std::mem::size_of::<DQCLRMEM>(),
        16usize,
        concat!("Size of: ", stringify!(DQCLRMEM))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCLRMEM>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCLRMEM))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCLRMEM>())).devmask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCLRMEM),
            "::",
            stringify!(devmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCLRMEM>())).cmd as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCLRMEM),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCLRMEM>())).mode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCLRMEM),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCLRMEM>())).status as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCLRMEM),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQRBF {
    pub err: uint32,
    pub processed_bytes: uint32,
    pub crc: uint32,
}
#[test]
fn bindgen_test_layout_DQRBF() {
    assert_eq!(
        ::std::mem::size_of::<DQRBF>(),
        12usize,
        concat!("Size of: ", stringify!(DQRBF))
    );
    assert_eq!(
        ::std::mem::align_of::<DQRBF>(),
        1usize,
        concat!("Alignment of ", stringify!(DQRBF))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBF>())).err as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBF),
            "::",
            stringify!(err)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBF>())).processed_bytes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBF),
            "::",
            stringify!(processed_bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBF>())).crc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBF),
            "::",
            stringify!(crc)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQRBFDEV {
    pub status: ::std::os::raw::c_int,
    pub system_type_dnr: uint8,
    pub logic_programmed: [uint8; 16usize],
    pub msp_present: [uint8; 16usize],
    pub layer_model: [uint16; 16usize],
    pub base_addr: [uint16; 16usize],
    pub logic_ver: [uint32; 16usize],
    pub error: [uint32; 16usize],
    pub msp_fw_ver: [uint8; 16usize],
    pub scd_silicon_id: [uint32; 16usize],
}
#[test]
fn bindgen_test_layout_DQRBFDEV() {
    assert_eq!(
        ::std::mem::size_of::<DQRBFDEV>(),
        309usize,
        concat!("Size of: ", stringify!(DQRBFDEV))
    );
    assert_eq!(
        ::std::mem::align_of::<DQRBFDEV>(),
        1usize,
        concat!("Alignment of ", stringify!(DQRBFDEV))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).system_type_dnr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(system_type_dnr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).logic_programmed as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(logic_programmed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).msp_present as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(msp_present)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).layer_model as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(layer_model)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).base_addr as *const _ as usize },
        69usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(base_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).logic_ver as *const _ as usize },
        101usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(logic_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).error as *const _ as usize },
        165usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(error)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).msp_fw_ver as *const _ as usize },
        229usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(msp_fw_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQRBFDEV>())).scd_silicon_id as *const _ as usize },
        245usize,
        concat!(
            "Offset of field: ",
            stringify!(DQRBFDEV),
            "::",
            stringify!(scd_silicon_id)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_SCHEME {
    pub sync_device: uint32,
    pub sync_source: uint32,
    pub sync_line: uint32,
    pub sync_mode: uint32,
    pub nPPS: uint32,
    pub nPPS_us: uint32,
    pub sync_server: uint32,
    pub srv_param: uint32,
    pub trig_server: uint32,
    pub clock_src: [uint32; 4usize],
    pub clock_tmr: [uint32; 4usize],
    pub clock_frq: [uint32; 4usize],
    pub clock_div: [uint32; 4usize],
    pub trig_source: uint32,
    pub trig_line: uint32,
    pub trig_start: uint32,
    pub trig_delay: uint32,
    pub trig_period_ms: uint32,
    pub trig_stop: uint32,
    pub trig_stop_src: uint32,
    pub trig_duration: uint32,
    pub clclk_dest: [uint32; 4usize],
    pub pps_dest: uint32,
    pub trig_dest: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_SCHEME() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_SCHEME>(),
        156usize,
        concat!("Size of: ", stringify!(DQ_SYNC_SCHEME))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_SCHEME>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_SCHEME))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).sync_device as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(sync_device)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).sync_source as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(sync_source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).sync_line as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(sync_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).sync_mode as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(sync_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).nPPS as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(nPPS)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).nPPS_us as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(nPPS_us)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).sync_server as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(sync_server)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).srv_param as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(srv_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_server as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_server)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).clock_src as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(clock_src)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).clock_tmr as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(clock_tmr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).clock_frq as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(clock_frq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).clock_div as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(clock_div)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_source as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_line as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_start as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_delay as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_delay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_period_ms as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_period_ms)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_stop as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_stop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_stop_src as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_stop_src)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_duration as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_duration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).clclk_dest as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(clclk_dest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).pps_dest as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(pps_dest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME>())).trig_dest as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME),
            "::",
            stringify!(trig_dest)
        )
    );
}
pub type pDQ_SYNC_SCHEME = *mut DQ_SYNC_SCHEME;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_SCHEME_AUX {
    pub syncpll: SYNCPLL,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_SCHEME_AUX() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_SCHEME_AUX>(),
        16usize,
        concat!("Size of: ", stringify!(DQ_SYNC_SCHEME_AUX))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_SCHEME_AUX>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_SCHEME_AUX))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_SCHEME_AUX>())).syncpll as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_SCHEME_AUX),
            "::",
            stringify!(syncpll)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_ADPLL_STAT {
    pub status: uint32,
    pub min_per: uint32,
    pub avg_per: uint32,
    pub max_per: uint32,
    pub lst_per: uint32,
    pub acc_err: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_ADPLL_STAT() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_ADPLL_STAT>(),
        24usize,
        concat!("Size of: ", stringify!(DQ_SYNC_ADPLL_STAT))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_ADPLL_STAT>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_ADPLL_STAT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_ADPLL_STAT>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_ADPLL_STAT),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_ADPLL_STAT>())).min_per as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_ADPLL_STAT),
            "::",
            stringify!(min_per)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_ADPLL_STAT>())).avg_per as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_ADPLL_STAT),
            "::",
            stringify!(avg_per)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_ADPLL_STAT>())).max_per as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_ADPLL_STAT),
            "::",
            stringify!(max_per)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_ADPLL_STAT>())).lst_per as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_ADPLL_STAT),
            "::",
            stringify!(lst_per)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_ADPLL_STAT>())).acc_err as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_ADPLL_STAT),
            "::",
            stringify!(acc_err)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_STATUS {
    pub adpll_sts: DQ_SYNC_ADPLL_STAT,
    pub pll_stat: [uint32; 2usize],
    pub pps_status: uint32,
    pub gps_irig: uint32,
    pub evm_stat: uint32,
    pub sync_snap: uint32,
    pub sync_conn: uint32,
    pub reserved: [uint32; 4usize],
    pub time_since_pps: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_STATUS() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_STATUS>(),
        72usize,
        concat!("Size of: ", stringify!(DQ_SYNC_STATUS))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_STATUS>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_STATUS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).adpll_sts as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(adpll_sts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).pll_stat as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(pll_stat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).pps_status as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(pps_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).gps_irig as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(gps_irig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).evm_stat as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(evm_stat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).sync_snap as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(sync_snap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).sync_conn as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(sync_conn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).reserved as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_STATUS>())).time_since_pps as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_STATUS),
            "::",
            stringify!(time_since_pps)
        )
    );
}
pub type pDQ_SYNC_STATUS = *mut DQ_SYNC_STATUS;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_DEFNTP {
    pub strata: uint32,
    pub resolution: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_DEFNTP() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_DEFNTP>(),
        8usize,
        concat!("Size of: ", stringify!(DQ_SYNC_DEFNTP))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_DEFNTP>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_DEFNTP))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFNTP>())).strata as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFNTP),
            "::",
            stringify!(strata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFNTP>())).resolution as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFNTP),
            "::",
            stringify!(resolution)
        )
    );
}
pub type pDQ_SYNC_DEFNTP = *mut DQ_SYNC_DEFNTP;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_DEFPTP {
    pub cfg: uint32,
    pub subdomain: uint8,
    pub priority1: uint8,
    pub priority2: uint8,
    pub logSyncInterval: int8,
    pub logMinDelayRequestInterval: int8,
    pub logAnnounceInterval: int8,
    pub announceTimeout: uint8,
    pub utcOffset: uint8,
    pub reserved: [uint32; 5usize],
    pub static_master_ip: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_DEFPTP() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_DEFPTP>(),
        36usize,
        concat!("Size of: ", stringify!(DQ_SYNC_DEFPTP))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_DEFPTP>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_DEFPTP))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).subdomain as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(subdomain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).priority1 as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(priority1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).priority2 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(priority2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).logSyncInterval as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(logSyncInterval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).logMinDelayRequestInterval as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(logMinDelayRequestInterval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).logAnnounceInterval as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(logAnnounceInterval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).announceTimeout as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(announceTimeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).utcOffset as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(utcOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).reserved as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEFPTP>())).static_master_ip as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEFPTP),
            "::",
            stringify!(static_master_ip)
        )
    );
}
pub type pDQ_SYNC_DEFPTP = *mut DQ_SYNC_DEFPTP;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_PTP_STAT {
    pub reserved: uint32,
    pub state: uint32,
    pub grandMasterClockID: uint64,
    pub masterClockID: uint64,
    pub stepsFromGrandMaster: uint32,
    pub grandMasterClockClass: uint32,
    pub reserved0: [uint32; 2usize],
    pub meanPathDelay: int32,
    pub lastMeasuredOffset: int32,
    pub maxMeasuredOffset: int32,
    pub minMeasuredOffset: int32,
    pub avgMeasuredOffset: int32,
    pub reserved1: [uint32; 8usize],
    pub totalPkts: uint32,
    pub announceRcvd: uint32,
    pub announceSnt: uint32,
    pub syncRcvd: uint32,
    pub syncSnt: uint32,
    pub followUpRcvd: uint32,
    pub followUpSnt: uint32,
    pub delyReqRcvd: uint32,
    pub delyReqSnt: uint32,
    pub delyRspRcvd: uint32,
    pub delyRspSnt: uint32,
    pub signalingRcvd: uint32,
    pub signalingSnt: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_PTP_STAT() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_PTP_STAT>(),
        144usize,
        concat!("Size of: ", stringify!(DQ_SYNC_PTP_STAT))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_PTP_STAT>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_PTP_STAT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).state as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).grandMasterClockID as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(grandMasterClockID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).masterClockID as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(masterClockID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).stepsFromGrandMaster as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(stepsFromGrandMaster)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).grandMasterClockClass as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(grandMasterClockClass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).reserved0 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(reserved0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).meanPathDelay as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(meanPathDelay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).lastMeasuredOffset as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(lastMeasuredOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).maxMeasuredOffset as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(maxMeasuredOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).minMeasuredOffset as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(minMeasuredOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).avgMeasuredOffset as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(avgMeasuredOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).reserved1 as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(reserved1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).totalPkts as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(totalPkts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).announceRcvd as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(announceRcvd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).announceSnt as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(announceSnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).syncRcvd as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(syncRcvd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).syncSnt as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(syncSnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).followUpRcvd as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(followUpRcvd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).followUpSnt as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(followUpSnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).delyReqRcvd as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(delyReqRcvd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).delyReqSnt as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(delyReqSnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).delyRspRcvd as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(delyRspRcvd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).delyRspSnt as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(delyRspSnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).signalingRcvd as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(signalingRcvd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_PTP_STAT>())).signalingSnt as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_PTP_STAT),
            "::",
            stringify!(signalingSnt)
        )
    );
}
pub type pDQ_SYNC_PTP_STAT = *mut DQ_SYNC_PTP_STAT;
pub const evsync_t_EVSYNC_CLEAR: evsync_t = 4096;
pub const evsync_t_EVSYNC_1PPS: evsync_t = 257;
pub const evsync_t_EVSYNC_ADPLL_LOST: evsync_t = 258;
pub const evsync_t_EVSYNC_NTP_LOST: evsync_t = 259;
pub const evsync_t_EVSYNC_PTP_LOST: evsync_t = 260;
pub const evsync_t_EVSYNC_GLOB_START: evsync_t = 261;
pub const evsync_t_EVSYNC_GLOB_STOP: evsync_t = 262;
pub type evsync_t = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_DEF_CLOCKS {
    pub clk_line: ::std::os::raw::c_int,
    pub divider: ::std::os::raw::c_int,
    pub grp_delay: ::std::os::raw::c_int,
    pub flags: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_DEF_CLOCKS() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_DEF_CLOCKS>(),
        16usize,
        concat!("Size of: ", stringify!(DQ_SYNC_DEF_CLOCKS))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_DEF_CLOCKS>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_DEF_CLOCKS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEF_CLOCKS>())).clk_line as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEF_CLOCKS),
            "::",
            stringify!(clk_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEF_CLOCKS>())).divider as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEF_CLOCKS),
            "::",
            stringify!(divider)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEF_CLOCKS>())).grp_delay as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEF_CLOCKS),
            "::",
            stringify!(grp_delay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_DEF_CLOCKS>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_DEF_CLOCKS),
            "::",
            stringify!(flags)
        )
    );
}
pub type pDQ_SYNC_DEF_CLOCKS = *mut DQ_SYNC_DEF_CLOCKS;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ_SYNC_UTC_TIME {
    pub reserved: uint32,
    pub sec: uint32,
    pub nsec: uint32,
    pub timestamp: uint32,
    pub flags: uint32,
}
#[test]
fn bindgen_test_layout_DQ_SYNC_UTC_TIME() {
    assert_eq!(
        ::std::mem::size_of::<DQ_SYNC_UTC_TIME>(),
        20usize,
        concat!("Size of: ", stringify!(DQ_SYNC_UTC_TIME))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ_SYNC_UTC_TIME>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ_SYNC_UTC_TIME))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_UTC_TIME>())).reserved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_UTC_TIME),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_UTC_TIME>())).sec as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_UTC_TIME),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_UTC_TIME>())).nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_UTC_TIME),
            "::",
            stringify!(nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_UTC_TIME>())).timestamp as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_UTC_TIME),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ_SYNC_UTC_TIME>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ_SYNC_UTC_TIME),
            "::",
            stringify!(flags)
        )
    );
}
pub type pDQ_SYNC_UTC_TIME = *mut DQ_SYNC_UTC_TIME;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQEECMNDEVS {
    pub model: uint16,
    pub option: uint16,
    pub total: uint16,
    pub sernum: uint32,
    pub mfgdate: uint32,
    pub caldate: uint32,
    pub calexpd: uint32,
}
#[test]
fn bindgen_test_layout_DQEECMNDEVS() {
    assert_eq!(
        ::std::mem::size_of::<DQEECMNDEVS>(),
        22usize,
        concat!("Size of: ", stringify!(DQEECMNDEVS))
    );
    assert_eq!(
        ::std::mem::align_of::<DQEECMNDEVS>(),
        1usize,
        concat!("Alignment of ", stringify!(DQEECMNDEVS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEECMNDEVS>())).model as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEECMNDEVS),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEECMNDEVS>())).option as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEECMNDEVS),
            "::",
            stringify!(option)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEECMNDEVS>())).total as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEECMNDEVS),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEECMNDEVS>())).sernum as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEECMNDEVS),
            "::",
            stringify!(sernum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEECMNDEVS>())).mfgdate as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEECMNDEVS),
            "::",
            stringify!(mfgdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEECMNDEVS>())).caldate as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEECMNDEVS),
            "::",
            stringify!(caldate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEECMNDEVS>())).calexpd as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEECMNDEVS),
            "::",
            stringify!(calexpd)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQEEPROMTAIL {
    pub ee_ver: uint16,
    pub crc: uint32,
}
#[test]
fn bindgen_test_layout_DQEEPROMTAIL() {
    assert_eq!(
        ::std::mem::size_of::<DQEEPROMTAIL>(),
        6usize,
        concat!("Size of: ", stringify!(DQEEPROMTAIL))
    );
    assert_eq!(
        ::std::mem::align_of::<DQEEPROMTAIL>(),
        1usize,
        concat!("Alignment of ", stringify!(DQEEPROMTAIL))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEEPROMTAIL>())).ee_ver as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEEPROMTAIL),
            "::",
            stringify!(ee_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEEPROMTAIL>())).crc as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEEPROMTAIL),
            "::",
            stringify!(crc)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQPRMFLAGS {
    pub flag_ver: uint32,
    pub dcard_sn: uint32,
    pub card_info: uint32,
    pub val: [uint32; 62usize],
}
#[test]
fn bindgen_test_layout_DQPRMFLAGS() {
    assert_eq!(
        ::std::mem::size_of::<DQPRMFLAGS>(),
        260usize,
        concat!("Size of: ", stringify!(DQPRMFLAGS))
    );
    assert_eq!(
        ::std::mem::align_of::<DQPRMFLAGS>(),
        1usize,
        concat!("Alignment of ", stringify!(DQPRMFLAGS))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPRMFLAGS>())).flag_ver as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPRMFLAGS),
            "::",
            stringify!(flag_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPRMFLAGS>())).dcard_sn as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPRMFLAGS),
            "::",
            stringify!(dcard_sn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPRMFLAGS>())).card_info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPRMFLAGS),
            "::",
            stringify!(card_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPRMFLAGS>())).val as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPRMFLAGS),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQPRMFLAGSA {
    pub flag_ver: uint32,
    pub dcard_sn: uint32,
    pub card_info: uint32,
}
#[test]
fn bindgen_test_layout_DQPRMFLAGSA() {
    assert_eq!(
        ::std::mem::size_of::<DQPRMFLAGSA>(),
        12usize,
        concat!("Size of: ", stringify!(DQPRMFLAGSA))
    );
    assert_eq!(
        ::std::mem::align_of::<DQPRMFLAGSA>(),
        1usize,
        concat!("Alignment of ", stringify!(DQPRMFLAGSA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPRMFLAGSA>())).flag_ver as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPRMFLAGSA),
            "::",
            stringify!(flag_ver)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPRMFLAGSA>())).dcard_sn as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPRMFLAGSA),
            "::",
            stringify!(dcard_sn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQPRMFLAGSA>())).card_info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQPRMFLAGSA),
            "::",
            stringify!(card_info)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_104 {
    pub cname: [[::std::os::raw::c_char; 32usize]; 2usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_104() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_104>(),
        64usize,
        concat!("Size of: ", stringify!(DQCNAMES_104))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_104>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_104))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_104>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_104),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCALSET_104 {
    pub cal: [uint8; 2usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_104() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_104>(),
        2usize,
        concat!("Size of: ", stringify!(DQCALSET_104))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_104>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_104))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_104>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_104),
            "::",
            stringify!(cal)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_104 {
    pub chlst: [uint32; 4usize],
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_104() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_104>(),
        20usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_104))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_104>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_104))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_104>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_104),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_104>())).clperint as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_104),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_105 {
    pub cname: [[::std::os::raw::c_char; 32usize]; 1usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_105() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_105>(),
        32usize,
        concat!("Size of: ", stringify!(DQCNAMES_105))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_105>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_105))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_105>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_105),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCALSET_105 {
    pub cal: [uint8; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_105() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_105>(),
        4usize,
        concat!("Size of: ", stringify!(DQCALSET_105))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_105>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_105))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_105>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_105),
            "::",
            stringify!(cal)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_105 {
    pub chlst: [uint32; 2usize],
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_105() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_105>(),
        12usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_105))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_105>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_105))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_105>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_105),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_105>())).clperint as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_105),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQINITPRM_105 {
    pub val: uint32,
}
#[test]
fn bindgen_test_layout_DQINITPRM_105() {
    assert_eq!(
        ::std::mem::size_of::<DQINITPRM_105>(),
        4usize,
        concat!("Size of: ", stringify!(DQINITPRM_105))
    );
    assert_eq!(
        ::std::mem::align_of::<DQINITPRM_105>(),
        1usize,
        concat!("Alignment of ", stringify!(DQINITPRM_105))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_105>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_105),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSDOWNPRM_105 {
    pub val: uint32,
}
#[test]
fn bindgen_test_layout_DQSDOWNPRM_105() {
    assert_eq!(
        ::std::mem::size_of::<DQSDOWNPRM_105>(),
        4usize,
        concat!("Size of: ", stringify!(DQSDOWNPRM_105))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSDOWNPRM_105>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSDOWNPRM_105))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSDOWNPRM_105>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSDOWNPRM_105),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_2000_ {
    pub cname: [[::std::os::raw::c_char; 20usize]; 16usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_2000_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_2000_>(),
        320usize,
        concat!("Size of: ", stringify!(DQCNAMES_2000_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_2000_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_2000_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_2000_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_2000_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_2000_ {
    pub level: [uint32; 16usize],
    pub gain: [uint32; 16usize],
    pub offset: [uint32; 16usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_2000_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_2000_>(),
        192usize,
        concat!("Size of: ", stringify!(DQCALSET_2000_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_2000_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_2000_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_2000_>())).level as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_2000_),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_2000_>())).gain as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_2000_),
            "::",
            stringify!(gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_2000_>())).offset as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_2000_),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_2000_ {
    pub ovr_lim: [uint32; 16usize],
    pub undr_lim: [uint32; 16usize],
    pub fan_on: uint32,
    pub fan_off: uint32,
    pub led_state: uint32,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_2000_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_2000_>(),
        140usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_2000_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_2000_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_2000_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_2000_>())).ovr_lim as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_2000_),
            "::",
            stringify!(ovr_lim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_2000_>())).undr_lim as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_2000_),
            "::",
            stringify!(undr_lim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_2000_>())).fan_on as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_2000_),
            "::",
            stringify!(fan_on)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_2000_>())).fan_off as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_2000_),
            "::",
            stringify!(fan_off)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_2000_>())).led_state as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_2000_),
            "::",
            stringify!(led_state)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQINITPRM_2000_ {
    pub val: uint32,
}
#[test]
fn bindgen_test_layout_DQINITPRM_2000_() {
    assert_eq!(
        ::std::mem::size_of::<DQINITPRM_2000_>(),
        4usize,
        concat!("Size of: ", stringify!(DQINITPRM_2000_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQINITPRM_2000_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQINITPRM_2000_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_2000_>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_2000_),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSDOWNPRM_2000_ {
    pub val: uint32,
}
#[test]
fn bindgen_test_layout_DQSDOWNPRM_2000_() {
    assert_eq!(
        ::std::mem::size_of::<DQSDOWNPRM_2000_>(),
        4usize,
        concat!("Size of: ", stringify!(DQSDOWNPRM_2000_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSDOWNPRM_2000_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSDOWNPRM_2000_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSDOWNPRM_2000_>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSDOWNPRM_2000_),
            "::",
            stringify!(val)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_201_ {
    pub cname: [[::std::os::raw::c_char; 20usize]; 24usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_201_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_201_>(),
        480usize,
        concat!("Size of: ", stringify!(DQCNAMES_201_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_201_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_201_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_201_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_201_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_201_ {
    pub cal: [uint8; 4usize],
    pub precref: [uint16; 2usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_201_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_201_>(),
        8usize,
        concat!("Size of: ", stringify!(DQCALSET_201_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_201_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_201_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_201_>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_201_),
            "::",
            stringify!(cal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_201_>())).precref as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_201_),
            "::",
            stringify!(precref)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_201_ {
    pub chlst: [uint32; 48usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_201_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_201_>(),
        212usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_201_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_201_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_201_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_201_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_201_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_201_>())).conf as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_201_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_201_>())).cvclk as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_201_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_201_>())).clclk as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_201_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_201_>())).trig as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_201_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_201_>())).clperint as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_201_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_204_ {
    pub cname: [[::std::os::raw::c_char; 16usize]; 31usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_204_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_204_>(),
        496usize,
        concat!("Size of: ", stringify!(DQCNAMES_204_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_204_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_204_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_204_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_204_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_204_ {
    pub gain: [[int32; 4usize]; 28usize],
    pub offs: [[int32; 4usize]; 28usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_204_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_204_>(),
        896usize,
        concat!("Size of: ", stringify!(DQCALSET_204_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_204_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_204_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_204_>())).gain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_204_),
            "::",
            stringify!(gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_204_>())).offs as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_204_),
            "::",
            stringify!(offs)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_204_ {
    pub chlst: [uint32; 31usize],
    pub conf: uint32,
    pub spd: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_204_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_204_>(),
        148usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_204_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_204_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_204_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_204_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_204_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_204_>())).conf as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_204_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_204_>())).spd as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_204_),
            "::",
            stringify!(spd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_204_>())).cvclk as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_204_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_204_>())).clclk as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_204_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_204_>())).trig as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_204_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_204_>())).clperint as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_204_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQINITPRM_204_ {
    pub res: uint32,
    pub cfg: uint32,
    pub limit: [uint32; 24usize],
}
#[test]
fn bindgen_test_layout_DQINITPRM_204_() {
    assert_eq!(
        ::std::mem::size_of::<DQINITPRM_204_>(),
        104usize,
        concat!("Size of: ", stringify!(DQINITPRM_204_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQINITPRM_204_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQINITPRM_204_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_204_>())).res as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_204_),
            "::",
            stringify!(res)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_204_>())).cfg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_204_),
            "::",
            stringify!(cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_204_>())).limit as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_204_),
            "::",
            stringify!(limit)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_205_ {
    pub cname: [[::std::os::raw::c_char; 32usize]; 4usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_205_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_205_>(),
        128usize,
        concat!("Size of: ", stringify!(DQCNAMES_205_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_205_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_205_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_205_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_205_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCALSET_205_ {
    pub cal: [uint8; 8usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_205_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_205_>(),
        8usize,
        concat!("Size of: ", stringify!(DQCALSET_205_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_205_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_205_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_205_>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_205_),
            "::",
            stringify!(cal)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_205_ {
    pub chlst: [uint32; 8usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub firtaps: [[uint8; 3usize]; 4usize],
    pub firdecr: [[uint8; 3usize]; 4usize],
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_205_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_205_>(),
        76usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_205_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_205_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_205_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).conf as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).cvclk as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).clclk as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).trig as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).firtaps as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(firtaps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).firdecr as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(firdecr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_205_>())).clperint as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_205_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_208_ {
    pub cname: [[::std::os::raw::c_char; 20usize]; 8usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_208_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_208_>(),
        160usize,
        concat!("Size of: ", stringify!(DQCNAMES_208_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_208_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_208_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_208_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_208_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_207_ {
    pub cname: [[::std::os::raw::c_char; 14usize]; 32usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_207_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_207_>(),
        448usize,
        concat!("Size of: ", stringify!(DQCNAMES_207_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_207_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_207_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_207_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_207_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_248_ {
    pub cname: [[::std::os::raw::c_char; 14usize]; 24usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_248_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_248_>(),
        336usize,
        concat!("Size of: ", stringify!(DQCNAMES_248_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_248_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_248_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_248_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_248_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_208_ {
    pub cal: [uint8; 4usize],
    pub offs_gain: [uint32; 12usize],
    pub gain_gain: [uint32; 12usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_208_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_208_>(),
        100usize,
        concat!("Size of: ", stringify!(DQCALSET_208_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_208_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_208_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_208_>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_208_),
            "::",
            stringify!(cal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_208_>())).offs_gain as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_208_),
            "::",
            stringify!(offs_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_208_>())).gain_gain as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_208_),
            "::",
            stringify!(gain_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_248_ {
    pub offs: [uint32; 4usize],
    pub gain: [uint32; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_248_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_248_>(),
        32usize,
        concat!("Size of: ", stringify!(DQCALSET_248_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_248_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_248_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_248_>())).offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_248_),
            "::",
            stringify!(offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_248_>())).gain as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_248_),
            "::",
            stringify!(gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_208_ {
    pub chlst: [uint32; 16usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_208_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_208_>(),
        84usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_208_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_208_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_208_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_208_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_208_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_208_>())).conf as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_208_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_208_>())).cvclk as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_208_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_208_>())).clclk as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_208_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_208_>())).trig as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_208_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_208_>())).clperint as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_208_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_248_ {
    pub chlst: [uint32; 26usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_248_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_248_>(),
        124usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_248_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_248_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_248_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_248_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_248_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_248_>())).conf as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_248_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_248_>())).cvclk as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_248_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_248_>())).clclk as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_248_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_248_>())).trig as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_248_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_248_>())).clperint as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_248_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQINITPRM_248_ {
    pub dio_init: uint16,
    pub dio_state: uint16,
}
#[test]
fn bindgen_test_layout_DQINITPRM_248_() {
    assert_eq!(
        ::std::mem::size_of::<DQINITPRM_248_>(),
        4usize,
        concat!("Size of: ", stringify!(DQINITPRM_248_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQINITPRM_248_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQINITPRM_248_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_248_>())).dio_init as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_248_),
            "::",
            stringify!(dio_init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_248_>())).dio_state as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_248_),
            "::",
            stringify!(dio_state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCFGCH_211 {
    pub channels: uint16,
    pub mask: uint16,
    pub biasdrive: uint16,
    pub biasonoff: uint16,
    pub comphi: uint16,
    pub complo: uint16,
    pub alarmctrl: uint16,
    pub hpf: uint16,
    pub offset: uint16,
    pub anafilt: uint16,
    pub main_enb: uint16,
    pub sec_enbs: uint16,
    pub secn: uint16,
}
#[test]
fn bindgen_test_layout_DQCFGCH_211() {
    assert_eq!(
        ::std::mem::size_of::<DQCFGCH_211>(),
        26usize,
        concat!("Size of: ", stringify!(DQCFGCH_211))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCFGCH_211>(),
        2usize,
        concat!("Alignment of ", stringify!(DQCFGCH_211))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).channels as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(channels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).mask as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).biasdrive as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(biasdrive)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).biasonoff as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(biasonoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).comphi as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(comphi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).complo as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(complo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).alarmctrl as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(alarmctrl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).hpf as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(hpf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).anafilt as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(anafilt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).main_enb as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(main_enb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).sec_enbs as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(sec_enbs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGCH_211>())).secn as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGCH_211),
            "::",
            stringify!(secn)
        )
    );
}
pub type pDQCFGCH_211 = *mut DQCFGCH_211;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCFGLAYER_211 {
    pub mask: uint16,
    pub clksrc: uint16,
    pub clkdiv: uint16,
    pub fmtr: uint16,
    pub avg_factor: uint16,
    pub dec_factor: uint16,
}
#[test]
fn bindgen_test_layout_DQCFGLAYER_211() {
    assert_eq!(
        ::std::mem::size_of::<DQCFGLAYER_211>(),
        12usize,
        concat!("Size of: ", stringify!(DQCFGLAYER_211))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCFGLAYER_211>(),
        2usize,
        concat!("Alignment of ", stringify!(DQCFGLAYER_211))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGLAYER_211>())).mask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGLAYER_211),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGLAYER_211>())).clksrc as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGLAYER_211),
            "::",
            stringify!(clksrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGLAYER_211>())).clkdiv as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGLAYER_211),
            "::",
            stringify!(clkdiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGLAYER_211>())).fmtr as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGLAYER_211),
            "::",
            stringify!(fmtr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGLAYER_211>())).avg_factor as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGLAYER_211),
            "::",
            stringify!(avg_factor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCFGLAYER_211>())).dec_factor as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCFGLAYER_211),
            "::",
            stringify!(dec_factor)
        )
    );
}
pub type pDQCFGLAYER_211 = *mut DQCFGLAYER_211;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_211_ {
    pub cname: [[::std::os::raw::c_char; 32usize]; 4usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_211_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_211_>(),
        128usize,
        concat!("Size of: ", stringify!(DQCNAMES_211_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_211_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_211_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_211_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_211_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CAL_DAC_SET_211 {
    pub cal_dac: [[uint8; 8usize]; 4usize],
}
#[test]
fn bindgen_test_layout_CAL_DAC_SET_211() {
    assert_eq!(
        ::std::mem::size_of::<CAL_DAC_SET_211>(),
        32usize,
        concat!("Size of: ", stringify!(CAL_DAC_SET_211))
    );
    assert_eq!(
        ::std::mem::align_of::<CAL_DAC_SET_211>(),
        1usize,
        concat!("Alignment of ", stringify!(CAL_DAC_SET_211))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_211>())).cal_dac as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_211),
            "::",
            stringify!(cal_dac)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCALSET_211_ {
    pub conf: [CAL_DAC_SET_211; 8usize],
    pub i_drive_8ma: [uint8; 4usize],
    pub i_drive_1ma: [uint8; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_211_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_211_>(),
        264usize,
        concat!("Size of: ", stringify!(DQCALSET_211_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_211_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_211_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_211_>())).conf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_211_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_211_>())).i_drive_8ma as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_211_),
            "::",
            stringify!(i_drive_8ma)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_211_>())).i_drive_1ma as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_211_),
            "::",
            stringify!(i_drive_1ma)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct CAL_DAC_SET_EXT_211 {
    pub factor: [[uint32; 8usize]; 4usize],
}
#[test]
fn bindgen_test_layout_CAL_DAC_SET_EXT_211() {
    assert_eq!(
        ::std::mem::size_of::<CAL_DAC_SET_EXT_211>(),
        128usize,
        concat!("Size of: ", stringify!(CAL_DAC_SET_EXT_211))
    );
    assert_eq!(
        ::std::mem::align_of::<CAL_DAC_SET_EXT_211>(),
        1usize,
        concat!("Alignment of ", stringify!(CAL_DAC_SET_EXT_211))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_EXT_211>())).factor as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_EXT_211),
            "::",
            stringify!(factor)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCALSET_EXT_AFON_211_ {
    pub conf: [CAL_DAC_SET_EXT_211; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_EXT_AFON_211_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_EXT_AFON_211_>(),
        512usize,
        concat!("Size of: ", stringify!(DQCALSET_EXT_AFON_211_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_EXT_AFON_211_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_EXT_AFON_211_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_EXT_AFON_211_>())).conf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_EXT_AFON_211_),
            "::",
            stringify!(conf)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCALSET_EXT_AFOFF_211_ {
    pub conf: [CAL_DAC_SET_EXT_211; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_EXT_AFOFF_211_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_EXT_AFOFF_211_>(),
        512usize,
        concat!("Size of: ", stringify!(DQCALSET_EXT_AFOFF_211_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_EXT_AFOFF_211_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_EXT_AFOFF_211_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_EXT_AFOFF_211_>())).conf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_EXT_AFOFF_211_),
            "::",
            stringify!(conf)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_211_ {
    pub chlst: [uint32; 8usize],
    pub clperint: ::std::os::raw::c_int,
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clkcfg: uint32,
    pub clkdiv: uint32,
    pub cfgamg: [uint32; 4usize],
    pub cfgdpn: [uint32; 4usize],
    pub cfgbias: [uint32; 4usize],
    pub cfgcomp: [uint32; 4usize],
    pub firtaps: [uint16; 4usize],
    pub firdecr: [uint16; 4usize],
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_211_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_211_>(),
        140usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_211_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_211_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_211_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).clperint as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(clperint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).conf as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).cvclk as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).clclk as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).trig as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).clkcfg as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(clkcfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).clkdiv as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(clkdiv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).cfgamg as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(cfgamg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).cfgdpn as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(cfgdpn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).cfgbias as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(cfgbias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).cfgcomp as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(cfgcomp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).firtaps as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(firtaps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_211_>())).firdecr as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_211_),
            "::",
            stringify!(firdecr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_212_ {
    pub cname: [[::std::os::raw::c_char; 16usize]; 12usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_212_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_212_>(),
        192usize,
        concat!("Size of: ", stringify!(DQCNAMES_212_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_212_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_212_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_212_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_212_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct CAL_DAC_SET_212 {
    pub c_offs: [uint32; 7usize],
    pub c_gain: [uint32; 7usize],
}
#[test]
fn bindgen_test_layout_CAL_DAC_SET_212() {
    assert_eq!(
        ::std::mem::size_of::<CAL_DAC_SET_212>(),
        56usize,
        concat!("Size of: ", stringify!(CAL_DAC_SET_212))
    );
    assert_eq!(
        ::std::mem::align_of::<CAL_DAC_SET_212>(),
        1usize,
        concat!("Alignment of ", stringify!(CAL_DAC_SET_212))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_212>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_212),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_212>())).c_gain as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_212),
            "::",
            stringify!(c_gain)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CALVAL_222 {
    pub calval: [uint8; 3usize],
}
#[test]
fn bindgen_test_layout_CALVAL_222() {
    assert_eq!(
        ::std::mem::size_of::<CALVAL_222>(),
        3usize,
        concat!("Size of: ", stringify!(CALVAL_222))
    );
    assert_eq!(
        ::std::mem::align_of::<CALVAL_222>(),
        1usize,
        concat!("Alignment of ", stringify!(CALVAL_222))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CALVAL_222>())).calval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CALVAL_222),
            "::",
            stringify!(calval)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQ222DATA2 {
    pub measured_exc_3: [f64; 12usize],
    pub measured_exc_4: [f64; 12usize],
    pub measured_exc_2: [f64; 12usize],
}
#[test]
fn bindgen_test_layout_DQ222DATA2() {
    assert_eq!(
        ::std::mem::size_of::<DQ222DATA2>(),
        288usize,
        concat!("Size of: ", stringify!(DQ222DATA2))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ222DATA2>(),
        1usize,
        concat!("Alignment of ", stringify!(DQ222DATA2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ222DATA2>())).measured_exc_3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ222DATA2),
            "::",
            stringify!(measured_exc_3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ222DATA2>())).measured_exc_4 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ222DATA2),
            "::",
            stringify!(measured_exc_4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ222DATA2>())).measured_exc_2 as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ222DATA2),
            "::",
            stringify!(measured_exc_2)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct CAL_DAC_SET_222 {
    pub c_offs1: [uint16; 4usize],
    pub c_offs2: [uint16; 4usize],
    pub c_gain1: [CALVAL_222; 4usize],
    pub c_gain2: [CALVAL_222; 4usize],
}
#[test]
fn bindgen_test_layout_CAL_DAC_SET_222() {
    assert_eq!(
        ::std::mem::size_of::<CAL_DAC_SET_222>(),
        40usize,
        concat!("Size of: ", stringify!(CAL_DAC_SET_222))
    );
    assert_eq!(
        ::std::mem::align_of::<CAL_DAC_SET_222>(),
        1usize,
        concat!("Alignment of ", stringify!(CAL_DAC_SET_222))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_222>())).c_offs1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_222),
            "::",
            stringify!(c_offs1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_222>())).c_offs2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_222),
            "::",
            stringify!(c_offs2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_222>())).c_gain1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_222),
            "::",
            stringify!(c_gain1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_222>())).c_gain2 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_222),
            "::",
            stringify!(c_gain2)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_212_ {
    pub conf: [CAL_DAC_SET_212; 12usize],
    pub confr: [CAL_DAC_SET_212; 12usize],
    pub res1: [uint16; 5usize],
    pub res2: [int16; 5usize],
    pub iexc: [[CALVAL_222; 8usize]; 12usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_212_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_212_>(),
        1652usize,
        concat!("Size of: ", stringify!(DQCALSET_212_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_212_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_212_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_>())).conf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_>())).confr as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_),
            "::",
            stringify!(confr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_>())).res1 as *const _ as usize },
        1344usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_),
            "::",
            stringify!(res1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_>())).res2 as *const _ as usize },
        1354usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_),
            "::",
            stringify!(res2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_>())).iexc as *const _ as usize },
        1364usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_),
            "::",
            stringify!(iexc)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_222_ {
    pub conf_3: [CAL_DAC_SET_222; 12usize],
    pub conf_4: [CAL_DAC_SET_222; 12usize],
    pub res1: [uint16; 5usize],
    pub res2: [int16; 5usize],
    pub iexc_3: [CALVAL_222; 12usize],
    pub iexc_4: [CALVAL_222; 12usize],
    pub iexc_2: [CALVAL_222; 12usize],
    pub conf_2: [CAL_DAC_SET_222; 12usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_222_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_222_>(),
        1568usize,
        concat!("Size of: ", stringify!(DQCALSET_222_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_222_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_222_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).conf_3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(conf_3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).conf_4 as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(conf_4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).res1 as *const _ as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(res1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).res2 as *const _ as usize },
        970usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(res2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).iexc_3 as *const _ as usize },
        980usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(iexc_3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).iexc_4 as *const _ as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(iexc_4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).iexc_2 as *const _ as usize },
        1052usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(iexc_2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_222_>())).conf_2 as *const _ as usize },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_222_),
            "::",
            stringify!(conf_2)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_212_X {
    pub conf0_5: [CAL_DAC_SET_212; 6usize],
    pub conf6_11: [CAL_DAC_SET_212; 6usize],
    pub confr0_5: [CAL_DAC_SET_212; 6usize],
    pub confr6_11: [CAL_DAC_SET_212; 6usize],
    pub res1: [uint16; 5usize],
    pub res2: [int16; 5usize],
    pub iexc: [[CALVAL_222; 8usize]; 12usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_212_X() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_212_X>(),
        1652usize,
        concat!("Size of: ", stringify!(DQCALSET_212_X))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_212_X>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_212_X))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_X>())).conf0_5 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_X),
            "::",
            stringify!(conf0_5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_X>())).conf6_11 as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_X),
            "::",
            stringify!(conf6_11)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_X>())).confr0_5 as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_X),
            "::",
            stringify!(confr0_5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_X>())).confr6_11 as *const _ as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_X),
            "::",
            stringify!(confr6_11)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_X>())).res1 as *const _ as usize },
        1344usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_X),
            "::",
            stringify!(res1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_X>())).res2 as *const _ as usize },
        1354usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_X),
            "::",
            stringify!(res2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_212_X>())).iexc as *const _ as usize },
        1364usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_212_X),
            "::",
            stringify!(iexc)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_212_ {
    pub resv3: [uint32; 5usize],
    pub chlst: [uint32; 24usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
    pub movavg: uint32,
    pub resv2: uint32,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_212_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_212_>(),
        144usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_212_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_212_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_212_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).resv3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(resv3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).chlst as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).conf as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).cvclk as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).clclk as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).trig as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).clperint as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(clperint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).movavg as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(movavg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_212_>())).resv2 as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_212_),
            "::",
            stringify!(resv2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_217_ {
    pub cname: [[::std::os::raw::c_char; 32usize]; 17usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_217_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_217_>(),
        544usize,
        concat!("Size of: ", stringify!(DQCNAMES_217_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_217_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_217_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_217_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_217_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct CAL_DAC_SET_217 {
    pub c_offs: [uint32; 7usize],
    pub c_gain: [uint32; 7usize],
}
#[test]
fn bindgen_test_layout_CAL_DAC_SET_217() {
    assert_eq!(
        ::std::mem::size_of::<CAL_DAC_SET_217>(),
        56usize,
        concat!("Size of: ", stringify!(CAL_DAC_SET_217))
    );
    assert_eq!(
        ::std::mem::align_of::<CAL_DAC_SET_217>(),
        1usize,
        concat!("Alignment of ", stringify!(CAL_DAC_SET_217))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_217>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_217),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CAL_DAC_SET_217>())).c_gain as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CAL_DAC_SET_217),
            "::",
            stringify!(c_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_217_ {
    pub conf: [CAL_DAC_SET_217; 16usize],
    pub cjc_offs: uint32,
    pub cjc_gain: uint32,
}
#[test]
fn bindgen_test_layout_DQCALSET_217_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_217_>(),
        904usize,
        concat!("Size of: ", stringify!(DQCALSET_217_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_217_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_217_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_217_>())).conf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_217_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_217_>())).cjc_offs as *const _ as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_217_),
            "::",
            stringify!(cjc_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_217_>())).cjc_gain as *const _ as usize },
        900usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_217_),
            "::",
            stringify!(cjc_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_217_X {
    pub conf0_7: [CAL_DAC_SET_217; 8usize],
    pub conf8_15: [CAL_DAC_SET_217; 8usize],
    pub cjc_offs: uint32,
    pub cjc_gain: uint32,
}
#[test]
fn bindgen_test_layout_DQCALSET_217_X() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_217_X>(),
        904usize,
        concat!("Size of: ", stringify!(DQCALSET_217_X))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_217_X>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_217_X))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_217_X>())).conf0_7 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_217_X),
            "::",
            stringify!(conf0_7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_217_X>())).conf8_15 as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_217_X),
            "::",
            stringify!(conf8_15)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_217_X>())).cjc_offs as *const _ as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_217_X),
            "::",
            stringify!(cjc_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_217_X>())).cjc_gain as *const _ as usize },
        900usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_217_X),
            "::",
            stringify!(cjc_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_217_ {
    pub chlst: [uint32; 18usize],
    pub clperint: ::std::os::raw::c_int,
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clkcfg: uint32,
    pub firdecr: [uint32; 4usize],
    pub firfcfg: [uint32; 4usize],
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_217_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_217_>(),
        128usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_217_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_217_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_217_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).clperint as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(clperint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).conf as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).cvclk as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).clclk as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).trig as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).clkcfg as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(clkcfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).firdecr as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(firdecr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_217_>())).firfcfg as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_217_),
            "::",
            stringify!(firfcfg)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQINITPRM_218_ {
    pub diocfg10: [uint32; 8usize],
    pub diostate10: [uint32; 8usize],
    pub pgapen: uint32,
    pub pgarate: uint32,
    pub adctype: uint32,
    pub reserved: [uint32; 8usize],
}
#[test]
fn bindgen_test_layout_DQINITPRM_218_() {
    assert_eq!(
        ::std::mem::size_of::<DQINITPRM_218_>(),
        108usize,
        concat!("Size of: ", stringify!(DQINITPRM_218_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQINITPRM_218_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQINITPRM_218_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_218_>())).diocfg10 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_218_),
            "::",
            stringify!(diocfg10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_218_>())).diostate10 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_218_),
            "::",
            stringify!(diostate10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_218_>())).pgapen as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_218_),
            "::",
            stringify!(pgapen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_218_>())).pgarate as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_218_),
            "::",
            stringify!(pgarate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_218_>())).adctype as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_218_),
            "::",
            stringify!(adctype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_218_>())).reserved as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_218_),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_224_ {
    pub cname: [[::std::os::raw::c_char; 20usize]; 4usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_224_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_224_>(),
        80usize,
        concat!("Size of: ", stringify!(DQCNAMES_224_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_224_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_224_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_224_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_224_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_224_ {
    pub adc_gain: [[uint32; 10usize]; 4usize],
    pub adc_offs: [[uint32; 10usize]; 4usize],
    pub adc_null_gain: [[uint32; 10usize]; 4usize],
    pub adc_null_offs: [[uint32; 10usize]; 4usize],
    pub dac_gain: [[uint16; 4usize]; 4usize],
    pub dac_offs: [[uint16; 4usize]; 4usize],
    pub dac_c_gain: [[uint16; 10usize]; 4usize],
    pub dac_c_offs: [[uint16; 10usize]; 4usize],
    pub multiplier: [int32; 4usize],
    pub shift: [uint16; 4usize],
    pub dcalg: [[int8; 4usize]; 4usize],
    pub dcalo: [[int8; 4usize]; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_224_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_224_>(),
        920usize,
        concat!("Size of: ", stringify!(DQCALSET_224_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_224_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_224_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).adc_gain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(adc_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).adc_offs as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(adc_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).adc_null_gain as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(adc_null_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).adc_null_offs as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(adc_null_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).dac_gain as *const _ as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(dac_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).dac_offs as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(dac_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).dac_c_gain as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(dac_c_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).dac_c_offs as *const _ as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(dac_c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).multiplier as *const _ as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(multiplier)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).shift as *const _ as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).dcalg as *const _ as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(dcalg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_224_>())).dcalo as *const _ as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_224_),
            "::",
            stringify!(dcalo)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_224_ {
    pub chlst: [uint32; 8usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
    pub firtaps: [uint16; 4usize],
    pub firdecr: [uint8; 4usize],
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_224_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_224_>(),
        64usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_224_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_224_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_224_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).conf as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).cvclk as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).clclk as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).trig as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).clperint as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(clperint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).firtaps as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(firtaps)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_224_>())).firdecr as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_224_),
            "::",
            stringify!(firdecr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQAI225CALDATA {
    pub cvolt: int32,
    pub cval: [int32; 26usize],
    pub coffs: [int32; 26usize],
    pub gain: [f64; 26usize],
}
#[test]
fn bindgen_test_layout_DQAI225CALDATA() {
    assert_eq!(
        ::std::mem::size_of::<DQAI225CALDATA>(),
        424usize,
        concat!("Size of: ", stringify!(DQAI225CALDATA))
    );
    assert_eq!(
        ::std::mem::align_of::<DQAI225CALDATA>(),
        8usize,
        concat!("Alignment of ", stringify!(DQAI225CALDATA))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI225CALDATA>())).cvolt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI225CALDATA),
            "::",
            stringify!(cvolt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI225CALDATA>())).cval as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI225CALDATA),
            "::",
            stringify!(cval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI225CALDATA>())).coffs as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI225CALDATA),
            "::",
            stringify!(coffs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI225CALDATA>())).gain as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI225CALDATA),
            "::",
            stringify!(gain)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_225_ {
    pub cname: [[::std::os::raw::c_char; 16usize]; 26usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_225_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_225_>(),
        416usize,
        concat!("Size of: ", stringify!(DQCNAMES_225_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_225_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_225_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_225_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_225_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_225_ {
    pub cvolt: int32,
    pub cval: [int32; 26usize],
    pub offs: [int32; 26usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_225_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_225_>(),
        212usize,
        concat!("Size of: ", stringify!(DQCALSET_225_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_225_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_225_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_225_>())).cvolt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_225_),
            "::",
            stringify!(cvolt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_225_>())).cval as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_225_),
            "::",
            stringify!(cval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_225_>())).offs as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_225_),
            "::",
            stringify!(offs)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_225_ {
    pub chlst: [uint32; 26usize],
    pub conf: uint32,
    pub spd: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_225_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_225_>(),
        120usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_225_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_225_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_225_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_225_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_225_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_225_>())).conf as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_225_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_225_>())).spd as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_225_),
            "::",
            stringify!(spd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_225_>())).trig as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_225_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_225_>())).clperint as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_225_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQ254SetExt {
    pub PositionAvg: uint32,
    pub MinMaxAvg: uint32,
    pub ZeroCrossing: uint32,
    pub ZeroLevel: uint32,
}
#[test]
fn bindgen_test_layout_DQ254SetExt() {
    assert_eq!(
        ::std::mem::size_of::<DQ254SetExt>(),
        16usize,
        concat!("Size of: ", stringify!(DQ254SetExt))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ254SetExt>(),
        4usize,
        concat!("Alignment of ", stringify!(DQ254SetExt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ254SetExt>())).PositionAvg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ254SetExt),
            "::",
            stringify!(PositionAvg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ254SetExt>())).MinMaxAvg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ254SetExt),
            "::",
            stringify!(MinMaxAvg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ254SetExt>())).ZeroCrossing as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ254SetExt),
            "::",
            stringify!(ZeroCrossing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ254SetExt>())).ZeroLevel as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ254SetExt),
            "::",
            stringify!(ZeroLevel)
        )
    );
}
pub type pDQ254SetExt = *mut DQ254SetExt;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_254_ {
    pub cname: [[::std::os::raw::c_char; 20usize]; 4usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_254_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_254_>(),
        80usize,
        concat!("Size of: ", stringify!(DQCNAMES_254_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_254_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_254_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_254_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_254_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALCHAN_254_ {
    pub u_gain: [uint32; 4usize],
    pub u_offs: [uint32; 4usize],
    pub voff_i_a: [uint16; 4usize],
    pub gain_i_a: [uint16; 4usize],
    pub voff_i_b: [uint16; 4usize],
    pub gain_i_b: [uint16; 4usize],
    pub voff_o_a: [uint16; 4usize],
    pub gain_o_a: [uint16; 4usize],
    pub voff_o_b: [uint16; 4usize],
    pub gain_o_b: [uint16; 4usize],
    pub voff_o_c: [uint16; 4usize],
    pub gain_o_c: [uint16; 4usize],
    pub voff_o_d: [uint16; 4usize],
    pub gain_o_d: [uint16; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALCHAN_254_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALCHAN_254_>(),
        128usize,
        concat!("Size of: ", stringify!(DQCALCHAN_254_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALCHAN_254_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALCHAN_254_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).u_gain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(u_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).u_offs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(u_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).voff_i_a as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(voff_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).gain_i_a as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(gain_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).voff_i_b as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(voff_i_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).gain_i_b as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(gain_i_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).voff_o_a as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(voff_o_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).gain_o_a as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(gain_o_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).voff_o_b as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(voff_o_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).gain_o_b as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(gain_o_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).voff_o_c as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(voff_o_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).gain_o_c as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(gain_o_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).voff_o_d as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(voff_o_d)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_254_>())).gain_o_d as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_254_),
            "::",
            stringify!(gain_o_d)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_254_ {
    pub cal: DQCALCHAN_254_,
    pub voff_i_a: [[uint16; 4usize]; 4usize],
    pub gain_i_a: [[uint16; 4usize]; 4usize],
    pub voff_i_b: [[uint16; 4usize]; 4usize],
    pub gain_i_b: [[uint16; 4usize]; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_254_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_254_>(),
        256usize,
        concat!("Size of: ", stringify!(DQCALSET_254_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_254_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_254_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_254_>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_254_),
            "::",
            stringify!(cal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_254_>())).voff_i_a as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_254_),
            "::",
            stringify!(voff_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_254_>())).gain_i_a as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_254_),
            "::",
            stringify!(gain_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_254_>())).voff_i_b as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_254_),
            "::",
            stringify!(voff_i_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_254_>())).gain_i_b as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_254_),
            "::",
            stringify!(gain_i_b)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_254_ {
    pub chlst: [uint32; 8usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_254_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_254_>(),
        52usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_254_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_254_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_254_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_254_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_254_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_254_>())).conf as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_254_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_254_>())).cvclk as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_254_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_254_>())).clclk as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_254_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_254_>())).trig as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_254_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_254_>())).clperint as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_254_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct WFPRM_254 {
    pub min_lvl: uint32,
    pub max_lvl: uint32,
    pub sum: uint32,
    pub cal: uint32,
    pub raw: uint32,
    pub zc0: uint32,
    pub zc1: uint32,
    pub zc0_var: uint32,
    pub zc1_var: uint32,
    pub raw_var: uint32,
    pub clk_frq: uint32,
    pub ampl: f32,
    pub freq: f32,
    pub offs: f32,
}
#[test]
fn bindgen_test_layout_WFPRM_254() {
    assert_eq!(
        ::std::mem::size_of::<WFPRM_254>(),
        56usize,
        concat!("Size of: ", stringify!(WFPRM_254))
    );
    assert_eq!(
        ::std::mem::align_of::<WFPRM_254>(),
        4usize,
        concat!("Alignment of ", stringify!(WFPRM_254))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).min_lvl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(min_lvl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).max_lvl as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(max_lvl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).sum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(sum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).cal as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(cal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).raw as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).zc0 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(zc0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).zc1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(zc1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).zc0_var as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(zc0_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).zc1_var as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(zc1_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).raw_var as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(raw_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).clk_frq as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(clk_frq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).ampl as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(ampl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).freq as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_254>())).offs as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_254),
            "::",
            stringify!(offs)
        )
    );
}
pub type pWFPRM_254 = *mut WFPRM_254;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct WFMEASURE_254 {
    pub changain: uint32,
    pub zero: uint32,
    pub clock: uint32,
    pub uzb: uint32,
    pub uaz: uint32,
    pub s_e: uint32,
    pub period_ms: uint32,
}
#[test]
fn bindgen_test_layout_WFMEASURE_254() {
    assert_eq!(
        ::std::mem::size_of::<WFMEASURE_254>(),
        28usize,
        concat!("Size of: ", stringify!(WFMEASURE_254))
    );
    assert_eq!(
        ::std::mem::align_of::<WFMEASURE_254>(),
        4usize,
        concat!("Alignment of ", stringify!(WFMEASURE_254))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_254>())).changain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_254),
            "::",
            stringify!(changain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_254>())).zero as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_254),
            "::",
            stringify!(zero)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_254>())).clock as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_254),
            "::",
            stringify!(clock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_254>())).uzb as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_254),
            "::",
            stringify!(uzb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_254>())).uaz as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_254),
            "::",
            stringify!(uaz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_254>())).s_e as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_254),
            "::",
            stringify!(s_e)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_254>())).period_ms as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_254),
            "::",
            stringify!(period_ms)
        )
    );
}
pub type pWFMEASURE_254 = *mut WFMEASURE_254;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQ255SetExt {
    pub PositionAvg: uint32,
    pub ZeroCrossing: uint32,
}
#[test]
fn bindgen_test_layout_DQ255SetExt() {
    assert_eq!(
        ::std::mem::size_of::<DQ255SetExt>(),
        8usize,
        concat!("Size of: ", stringify!(DQ255SetExt))
    );
    assert_eq!(
        ::std::mem::align_of::<DQ255SetExt>(),
        4usize,
        concat!("Alignment of ", stringify!(DQ255SetExt))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ255SetExt>())).PositionAvg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ255SetExt),
            "::",
            stringify!(PositionAvg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQ255SetExt>())).ZeroCrossing as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQ255SetExt),
            "::",
            stringify!(ZeroCrossing)
        )
    );
}
pub type pDQ255SetExt = *mut DQ255SetExt;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_255_ {
    pub cname: [[::std::os::raw::c_char; 20usize]; 2usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_255_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_255_>(),
        40usize,
        concat!("Size of: ", stringify!(DQCNAMES_255_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_255_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_255_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_255_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_255_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALCHAN_255_ {
    pub u_gain: [uint32; 2usize],
    pub u_offs: [uint32; 2usize],
    pub voff_i_a: [uint16; 2usize],
    pub gain_i_a: [uint16; 2usize],
    pub voff_i_b: [uint16; 2usize],
    pub gain_i_b: [uint16; 2usize],
    pub voff_i_c: [uint16; 2usize],
    pub gain_i_c: [uint16; 2usize],
    pub voff_i_d: [uint16; 2usize],
    pub gain_i_d: [uint16; 2usize],
    pub voff_o_a: [uint16; 2usize],
    pub gain_o_a: [uint16; 2usize],
    pub voff_o_b: [uint16; 2usize],
    pub gain_o_b: [uint16; 2usize],
    pub voff_o_c: [uint16; 2usize],
    pub gain_o_c: [uint16; 2usize],
    pub voff_o_d: [uint16; 2usize],
    pub gain_o_d: [uint16; 2usize],
}
#[test]
fn bindgen_test_layout_DQCALCHAN_255_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALCHAN_255_>(),
        80usize,
        concat!("Size of: ", stringify!(DQCALCHAN_255_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALCHAN_255_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALCHAN_255_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).u_gain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(u_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).u_offs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(u_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_i_a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_i_a as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_i_b as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_i_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_i_b as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_i_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_i_c as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_i_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_i_c as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_i_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_i_d as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_i_d)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_i_d as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_i_d)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_o_a as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_o_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_o_a as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_o_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_o_b as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_o_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_o_b as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_o_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_o_c as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_o_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_o_c as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_o_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).voff_o_d as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(voff_o_d)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALCHAN_255_>())).gain_o_d as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALCHAN_255_),
            "::",
            stringify!(gain_o_d)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_255_ {
    pub cal: DQCALCHAN_255_,
    pub voff_i_a: [[uint16; 4usize]; 2usize],
    pub gain_i_a: [[uint16; 4usize]; 2usize],
    pub voff_i_b: [[uint16; 4usize]; 2usize],
    pub gain_i_b: [[uint16; 4usize]; 2usize],
    pub voff_i_c: [[uint16; 4usize]; 2usize],
    pub gain_i_c: [[uint16; 4usize]; 2usize],
    pub voff_i_d: [[uint16; 4usize]; 2usize],
    pub gain_i_d: [[uint16; 4usize]; 2usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_255_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_255_>(),
        208usize,
        concat!("Size of: ", stringify!(DQCALSET_255_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_255_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_255_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(cal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).voff_i_a as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(voff_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).gain_i_a as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(gain_i_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).voff_i_b as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(voff_i_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).gain_i_b as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(gain_i_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).voff_i_c as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(voff_i_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).gain_i_c as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(gain_i_c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).voff_i_d as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(voff_i_d)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_255_>())).gain_i_d as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_255_),
            "::",
            stringify!(gain_i_d)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_255_ {
    pub chlst: [uint32; 4usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_255_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_255_>(),
        36usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_255_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_255_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_255_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_255_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_255_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_255_>())).conf as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_255_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_255_>())).cvclk as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_255_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_255_>())).clclk as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_255_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_255_>())).trig as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_255_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_255_>())).clperint as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_255_),
            "::",
            stringify!(clperint)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_256_ {
    pub offs: [[uint16; 4usize]; 2usize],
    pub gain: [[uint16; 4usize]; 2usize],
    pub pdac_ffff: [uint16; 2usize],
    pub pdac_0000: [uint16; 2usize],
    pub reserved: [uint32; 4usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_256_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_256_>(),
        56usize,
        concat!("Size of: ", stringify!(DQCALSET_256_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_256_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_256_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_256_>())).offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_256_),
            "::",
            stringify!(offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_256_>())).gain as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_256_),
            "::",
            stringify!(gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_256_>())).pdac_ffff as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_256_),
            "::",
            stringify!(pdac_ffff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_256_>())).pdac_0000 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_256_),
            "::",
            stringify!(pdac_0000)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_256_>())).reserved as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_256_),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_256_ {
    pub oclimit: [uint32; 2usize],
    pub rdcnt: int32,
    pub adc_cfg: [uint32; 4usize],
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_256_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_256_>(),
        28usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_256_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_256_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_256_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_256_>())).oclimit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_256_),
            "::",
            stringify!(oclimit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_256_>())).rdcnt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_256_),
            "::",
            stringify!(rdcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_256_>())).adc_cfg as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_256_),
            "::",
            stringify!(adc_cfg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct WFPRM_255 {
    pub min_lvl: uint32,
    pub max_lvl: uint32,
    pub sum: uint32,
    pub cal: uint32,
    pub raw: uint32,
    pub zc0: uint32,
    pub zc1: uint32,
    pub zc0_var: uint32,
    pub zc1_var: uint32,
    pub cal_var: uint32,
    pub clk_frq: uint32,
    pub wf_phase: uint32,
    pub ampl: f32,
    pub freq: f32,
    pub offs: f32,
}
#[test]
fn bindgen_test_layout_WFPRM_255() {
    assert_eq!(
        ::std::mem::size_of::<WFPRM_255>(),
        60usize,
        concat!("Size of: ", stringify!(WFPRM_255))
    );
    assert_eq!(
        ::std::mem::align_of::<WFPRM_255>(),
        4usize,
        concat!("Alignment of ", stringify!(WFPRM_255))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).min_lvl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(min_lvl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).max_lvl as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(max_lvl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).sum as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(sum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).cal as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(cal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).raw as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).zc0 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(zc0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).zc1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(zc1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).zc0_var as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(zc0_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).zc1_var as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(zc1_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).cal_var as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(cal_var)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).clk_frq as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(clk_frq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).wf_phase as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(wf_phase)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).ampl as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(ampl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).freq as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFPRM_255>())).offs as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(WFPRM_255),
            "::",
            stringify!(offs)
        )
    );
}
pub type pWFPRM_255 = *mut WFPRM_255;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct WFMEASURE_255 {
    pub changain: uint32,
    pub zero: uint32,
    pub clock: uint32,
    pub uzb: uint32,
    pub uaz: uint32,
    pub s_e: uint32,
    pub period_ms: uint32,
    pub phase_meas: uint32,
}
#[test]
fn bindgen_test_layout_WFMEASURE_255() {
    assert_eq!(
        ::std::mem::size_of::<WFMEASURE_255>(),
        32usize,
        concat!("Size of: ", stringify!(WFMEASURE_255))
    );
    assert_eq!(
        ::std::mem::align_of::<WFMEASURE_255>(),
        4usize,
        concat!("Alignment of ", stringify!(WFMEASURE_255))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).changain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(changain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).zero as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(zero)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).clock as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(clock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).uzb as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(uzb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).uaz as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(uaz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).s_e as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(s_e)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).period_ms as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(period_ms)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WFMEASURE_255>())).phase_meas as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(WFMEASURE_255),
            "::",
            stringify!(phase_meas)
        )
    );
}
pub type pWFMEASURE_255 = *mut WFMEASURE_255;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQAI256DATAIN {
    pub adcsts: int32,
    pub rdcnt: int32,
    pub adccfg: [int32; 4usize],
}
#[test]
fn bindgen_test_layout_DQAI256DATAIN() {
    assert_eq!(
        ::std::mem::size_of::<DQAI256DATAIN>(),
        24usize,
        concat!("Size of: ", stringify!(DQAI256DATAIN))
    );
    assert_eq!(
        ::std::mem::align_of::<DQAI256DATAIN>(),
        4usize,
        concat!("Alignment of ", stringify!(DQAI256DATAIN))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAIN>())).adcsts as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAIN),
            "::",
            stringify!(adcsts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAIN>())).rdcnt as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAIN),
            "::",
            stringify!(rdcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAIN>())).adccfg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAIN),
            "::",
            stringify!(adccfg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQAI256DATAOUT {
    pub cfgmask: int32,
    pub cfg: int32,
    pub portocm: int32,
    pub portocv0: int32,
    pub portocv1: int32,
    pub rdcnt: int32,
    pub adccfg: [int32; 4usize],
    pub reserved: [int32; 2usize],
}
#[test]
fn bindgen_test_layout_DQAI256DATAOUT() {
    assert_eq!(
        ::std::mem::size_of::<DQAI256DATAOUT>(),
        48usize,
        concat!("Size of: ", stringify!(DQAI256DATAOUT))
    );
    assert_eq!(
        ::std::mem::align_of::<DQAI256DATAOUT>(),
        4usize,
        concat!("Alignment of ", stringify!(DQAI256DATAOUT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).cfgmask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(cfgmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).cfg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).portocm as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(portocm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).portocv0 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(portocv0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).portocv1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(portocv1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).rdcnt as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(rdcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).adccfg as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(adccfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQAI256DATAOUT>())).reserved as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQAI256DATAOUT),
            "::",
            stringify!(reserved)
        )
    );
}
pub type pDQAI256DATAOUT = *mut DQAI256DATAOUT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_261_ {
    pub cname: [[::std::os::raw::c_char; 16usize]; 17usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_261_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_261_>(),
        272usize,
        concat!("Size of: ", stringify!(DQCNAMES_261_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_261_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_261_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_261_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_261_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCAL_DAC_INT_261_IDC {
    pub c_offs: [uint32; 11usize],
    pub c_gain: [uint32; 11usize],
}
#[test]
fn bindgen_test_layout_DQCAL_DAC_INT_261_IDC() {
    assert_eq!(
        ::std::mem::size_of::<DQCAL_DAC_INT_261_IDC>(),
        88usize,
        concat!("Size of: ", stringify!(DQCAL_DAC_INT_261_IDC))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCAL_DAC_INT_261_IDC>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCAL_DAC_INT_261_IDC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_IDC>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_IDC),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_IDC>())).c_gain as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_IDC),
            "::",
            stringify!(c_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCAL_DAC_INT_261_IAC {
    pub c_offs: [uint32; 10usize],
    pub c_gain: [uint32; 10usize],
    pub pk_offs: [uint32; 10usize],
    pub pk_gain: [uint32; 10usize],
}
#[test]
fn bindgen_test_layout_DQCAL_DAC_INT_261_IAC() {
    assert_eq!(
        ::std::mem::size_of::<DQCAL_DAC_INT_261_IAC>(),
        160usize,
        concat!("Size of: ", stringify!(DQCAL_DAC_INT_261_IAC))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCAL_DAC_INT_261_IAC>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCAL_DAC_INT_261_IAC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_IAC>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_IAC),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_IAC>())).c_gain as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_IAC),
            "::",
            stringify!(c_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_IAC>())).pk_offs as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_IAC),
            "::",
            stringify!(pk_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_IAC>())).pk_gain as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_IAC),
            "::",
            stringify!(pk_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCAL_DAC_INT_261_VDC {
    pub c_offs: [uint32; 19usize],
    pub c_gain: [uint32; 19usize],
}
#[test]
fn bindgen_test_layout_DQCAL_DAC_INT_261_VDC() {
    assert_eq!(
        ::std::mem::size_of::<DQCAL_DAC_INT_261_VDC>(),
        152usize,
        concat!("Size of: ", stringify!(DQCAL_DAC_INT_261_VDC))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCAL_DAC_INT_261_VDC>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCAL_DAC_INT_261_VDC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_VDC>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_VDC),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_VDC>())).c_gain as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_VDC),
            "::",
            stringify!(c_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCAL_DAC_INT_261_VAC {
    pub c_offs: [uint32; 12usize],
    pub c_gain: [uint32; 12usize],
    pub pk_offs: [uint32; 12usize],
    pub pk_gain: [uint32; 12usize],
}
#[test]
fn bindgen_test_layout_DQCAL_DAC_INT_261_VAC() {
    assert_eq!(
        ::std::mem::size_of::<DQCAL_DAC_INT_261_VAC>(),
        192usize,
        concat!("Size of: ", stringify!(DQCAL_DAC_INT_261_VAC))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCAL_DAC_INT_261_VAC>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCAL_DAC_INT_261_VAC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_VAC>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_VAC),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_VAC>())).c_gain as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_VAC),
            "::",
            stringify!(c_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_VAC>())).pk_offs as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_VAC),
            "::",
            stringify!(pk_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_INT_261_VAC>())).pk_gain as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_INT_261_VAC),
            "::",
            stringify!(pk_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCAL_OFF_GN_261 {
    pub c_offs: uint32,
    pub c_gain: uint32,
}
#[test]
fn bindgen_test_layout_DQCAL_OFF_GN_261() {
    assert_eq!(
        ::std::mem::size_of::<DQCAL_OFF_GN_261>(),
        8usize,
        concat!("Size of: ", stringify!(DQCAL_OFF_GN_261))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCAL_OFF_GN_261>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCAL_OFF_GN_261))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_OFF_GN_261>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_OFF_GN_261),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_OFF_GN_261>())).c_gain as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_OFF_GN_261),
            "::",
            stringify!(c_gain)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCAL_DAC_SETRDEF_261 {
    pub c_offs: [int32; 8usize],
    pub c_gain: [uint32; 8usize],
    pub ref_offs: int32,
    pub ref_gain: uint32,
    pub excite: [uint32; 8usize],
}
#[test]
fn bindgen_test_layout_DQCAL_DAC_SETRDEF_261() {
    assert_eq!(
        ::std::mem::size_of::<DQCAL_DAC_SETRDEF_261>(),
        104usize,
        concat!("Size of: ", stringify!(DQCAL_DAC_SETRDEF_261))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCAL_DAC_SETRDEF_261>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCAL_DAC_SETRDEF_261))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_SETRDEF_261>())).c_offs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_SETRDEF_261),
            "::",
            stringify!(c_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_SETRDEF_261>())).c_gain as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_SETRDEF_261),
            "::",
            stringify!(c_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_SETRDEF_261>())).ref_offs as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_SETRDEF_261),
            "::",
            stringify!(ref_offs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_SETRDEF_261>())).ref_gain as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_SETRDEF_261),
            "::",
            stringify!(ref_gain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_SETRDEF_261>())).excite as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_SETRDEF_261),
            "::",
            stringify!(excite)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCAL_DAC_SETGVT_261 {
    pub vt: DQCAL_OFF_GN_261,
}
#[test]
fn bindgen_test_layout_DQCAL_DAC_SETGVT_261() {
    assert_eq!(
        ::std::mem::size_of::<DQCAL_DAC_SETGVT_261>(),
        8usize,
        concat!("Size of: ", stringify!(DQCAL_DAC_SETGVT_261))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCAL_DAC_SETGVT_261>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCAL_DAC_SETGVT_261))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCAL_DAC_SETGVT_261>())).vt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCAL_DAC_SETGVT_261),
            "::",
            stringify!(vt)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_261_ {
    pub confgvt: [DQCAL_DAC_SETGVT_261; 5usize],
    pub confgi: DQCAL_OFF_GN_261,
    pub limit_ma: uint32,
    pub hyst_ma: uint32,
    pub ref_r_res_x100: uint32,
    pub rn1_res: uint32,
    pub reserved: [uint32; 4usize],
    pub confgiac: DQCAL_OFF_GN_261,
    pub limit_ma_ac: uint32,
    pub hyst_ma_ac: uint32,
    pub confrd: DQCAL_DAC_SETRDEF_261,
    pub calidc: DQCAL_DAC_INT_261_IDC,
    pub caliac: DQCAL_DAC_INT_261_IAC,
    pub calvdc: DQCAL_DAC_INT_261_VDC,
    pub calvac: DQCAL_DAC_INT_261_VAC,
    pub vref5_10nv: int32,
    pub vref25v_10nv: int32,
    pub vref25i_10nv: int32,
}
#[test]
fn bindgen_test_layout_DQCALSET_261_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_261_>(),
        804usize,
        concat!("Size of: ", stringify!(DQCALSET_261_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_261_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_261_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).confgvt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(confgvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).confgi as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(confgi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).limit_ma as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(limit_ma)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).hyst_ma as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(hyst_ma)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).ref_r_res_x100 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(ref_r_res_x100)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).rn1_res as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(rn1_res)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).reserved as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).confgiac as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(confgiac)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).limit_ma_ac as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(limit_ma_ac)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).hyst_ma_ac as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(hyst_ma_ac)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).confrd as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(confrd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).calidc as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(calidc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).caliac as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(caliac)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).calvdc as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(calvdc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).calvac as *const _ as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(calvac)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).vref5_10nv as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(vref5_10nv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).vref25v_10nv as *const _ as usize },
        796usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(vref25v_10nv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_261_>())).vref25i_10nv as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_261_),
            "::",
            stringify!(vref25i_10nv)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_261_ {
    pub chlst: [uint32; 16usize],
    pub clperint: ::std::os::raw::c_int,
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub clkcfg: uint32,
    pub resvd: uint32,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_261_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_261_>(),
        92usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_261_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_261_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_261_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).clperint as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(clperint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).conf as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).cvclk as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).clclk as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(clclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).trig as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(trig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).clkcfg as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(clkcfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_261_>())).resvd as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_261_),
            "::",
            stringify!(resvd)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQINITPRM_261_ {
    pub cfg: uint32,
    pub val: [uint32; 16usize],
    pub line_freq: uint32,
    pub line_cycles: uint32,
    pub v_fir: uint32,
    pub i_fir: uint32,
    pub resvd: uint32,
}
#[test]
fn bindgen_test_layout_DQINITPRM_261_() {
    assert_eq!(
        ::std::mem::size_of::<DQINITPRM_261_>(),
        88usize,
        concat!("Size of: ", stringify!(DQINITPRM_261_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQINITPRM_261_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQINITPRM_261_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_261_>())).cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_261_),
            "::",
            stringify!(cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_261_>())).val as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_261_),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_261_>())).line_freq as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_261_),
            "::",
            stringify!(line_freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_261_>())).line_cycles as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_261_),
            "::",
            stringify!(line_cycles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_261_>())).v_fir as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_261_),
            "::",
            stringify!(v_fir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_261_>())).i_fir as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_261_),
            "::",
            stringify!(i_fir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQINITPRM_261_>())).resvd as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(DQINITPRM_261_),
            "::",
            stringify!(resvd)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQSDOWNPRM_261_ {
    pub cfg: uint32,
    pub val: [uint32; 16usize],
    pub resvd: uint32,
}
#[test]
fn bindgen_test_layout_DQSDOWNPRM_261_() {
    assert_eq!(
        ::std::mem::size_of::<DQSDOWNPRM_261_>(),
        72usize,
        concat!("Size of: ", stringify!(DQSDOWNPRM_261_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQSDOWNPRM_261_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQSDOWNPRM_261_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSDOWNPRM_261_>())).cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSDOWNPRM_261_),
            "::",
            stringify!(cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSDOWNPRM_261_>())).val as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSDOWNPRM_261_),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQSDOWNPRM_261_>())).resvd as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQSDOWNPRM_261_),
            "::",
            stringify!(resvd)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQEERSVD_261_ {
    pub res: [uint8; 680usize],
}
#[test]
fn bindgen_test_layout_DQEERSVD_261_() {
    assert_eq!(
        ::std::mem::size_of::<DQEERSVD_261_>(),
        680usize,
        concat!("Size of: ", stringify!(DQEERSVD_261_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQEERSVD_261_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQEERSVD_261_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQEERSVD_261_>())).res as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQEERSVD_261_),
            "::",
            stringify!(res)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct DQCNAMES_301_ {
    pub cname: [[::std::os::raw::c_char; 32usize]; 8usize],
}
#[test]
fn bindgen_test_layout_DQCNAMES_301_() {
    assert_eq!(
        ::std::mem::size_of::<DQCNAMES_301_>(),
        256usize,
        concat!("Size of: ", stringify!(DQCNAMES_301_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCNAMES_301_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCNAMES_301_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCNAMES_301_>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCNAMES_301_),
            "::",
            stringify!(cname)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQCALSET_301_ {
    pub cal: [uint16; 4usize],
    pub dcal: [uint8; 16usize],
}
#[test]
fn bindgen_test_layout_DQCALSET_301_() {
    assert_eq!(
        ::std::mem::size_of::<DQCALSET_301_>(),
        24usize,
        concat!("Size of: ", stringify!(DQCALSET_301_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQCALSET_301_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQCALSET_301_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_301_>())).cal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_301_),
            "::",
            stringify!(cal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQCALSET_301_>())).dcal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DQCALSET_301_),
            "::",
            stringify!(dcal)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct DQOPMODEPRM_301_ {
    pub chlst: [uint32; 16usize],
    pub conf: uint32,
    pub cvclk: uint32,
    pub clclk: uint32,
    pub trig: uint32,
    pub cfg: uint32,
    pub val: [uint16; 8usize],
    pub clperint: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DQOPMODEPRM_301_() {
    assert_eq!(
        ::std::mem::size_of::<DQOPMODEPRM_301_>(),
        104usize,
        concat!("Size of: ", stringify!(DQOPMODEPRM_301_))
    );
    assert_eq!(
        ::std::mem::align_of::<DQOPMODEPRM_301_>(),
        1usize,
        concat!("Alignment of ", stringify!(DQOPMODEPRM_301_))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_301_>())).chlst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_301_),
            "::",
            stringify!(chlst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_301_>())).conf as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_301_),
            "::",
            stringify!(conf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_301_>())).cvclk as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(DQOPMODEPRM_301_),
            "::",
            stringify!(cvclk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DQOPMODEPRM_301_>())).clclk as *const _ as usize },
